{
    "patient_id": "history_physical_78",
    "raw_text": "Gender: Female\n\nAge: 14\n\nMRN: 766532\n\nDiagnosis: Hepatocellular Carcinoma\n\nHistory and Physical:\n\nDoctor:\n\nHello, Umme Hani. How are you feeling today?\n\nPatient:\n\nIm okay, Doctor, but I still have some concerns.\n\nDoctor:\n\nI see. Lets go over your medical history and the findings from your previous visits. You had your first\n\nvisit to the pediatric gastroenterology clinic on April 18, 2024, for complaints related to a history of\n\nupper gastrointestinal bleeding (UGIB). Is that right?\n\nPatient:\n\nYes, Doctor. I had a major bleeding episode in December. I was in USOH, and I suddenly vomited\n\nblood. The next day, I had another episode, and I also passed black stools for three days.\n\nDoctor:\n\nI understand. You were admitted to Faisalabad Civil Hospital, where they performed an endoscopy\n\nand transfused two units of packed cells. You didnt need fresh frozen plasma. After that, you were\n\ntransferred  to  Nishtar  Hospital,  where  the  ultrasound  showed  an  unspecified  liver  disease.  Is  that\n\ncorrect?\n\nPatient:\n\n\fYes, thats correct.\n\nDoctor:\n\nLets  review  your  examination  findings.  Your  weight  is  31  kg,  and  your  height  is  157  cm,  which\n\nplaces you below the 3rd centile for weight and at the 25th centile for height. Theres no jaundice,\n\npallor, or edema. I also noted that your spleen was palpable by 3 cm but your liver wasnt palpable.\n\nPatient:\n\nI remember that. Its been hard for me to maintain a healthy weight.\n\nDoctor:\n\nYour  liver  function  tests  show  that  your  bilirubin  was  slightly  elevated  at  1.6  mg/dL,  and  your  liver\n\nenzymes (ALT, AST, ALP, GGT) were abnormal, with ALT at 93 and ALP at 990. Your albumin was\n\nlow at 2.7 g/dL, and your INR was 1.9, which is a bit concerning for liver dysfunction.\n\nPatient:\n\nThat sounds like its pretty serious.\n\nDoctor:\n\nYes,  Umme  Hani.  Your  liver  condition  is  indeed  concerning.  You  underwent  a  liver  biopsy  on\n\nJanuary  31,  2024,  which  showed  mild  interface  hepatitis  and  portal  tract  fibrosis,  without  cirrhotic\n\nnodules.  The  fibrosis  was  graded  at  stage  1,  but  moderate  portal  inflammation  was  present.  The\n\nultrasound on April 13, 2024, revealed coarse cirrhotic liver with a focal lesion in the left lobe, which\n\ncould  be  a  hepatocellular  carcinoma  (HCC).  Additionally,  the  CT  scan  on  January  2,  2024,\n\nconfirmed cirrhosis but didnt show any arterialized lesions to suggest HCC at that time.\n\nPatient:\n\n\fIm really worried about the HCC diagnosis. What does that mean for me?\n\nDoctor:\n\nYour condition has been closely monitored. The recent investigations, including a liver lesion biopsy\n\non April 24, 2024, confirmed the presence of well-differentiated hepatocellular carcinoma (HCC) in\n\nthe background of cirrhotic liver. This means that there is a liver cancer that has developed due to\n\nyour  chronic  liver  disease.  However,  there  are  no  signs  of  vascular  invasion,  which  is  somewhat\n\nreassuring.\n\nPatient:\n\nThat sounds serious. Whats the next step for me?\n\nDoctor:\n\nWe will need to start treatment for your condition. Weve prescribed Ceclor 500 mg twice a day for 5\n\ndays  and  Azithromycin  250  mg  once  a  day  for  3  days  to  manage  any  infections.  For  now,  we  will\n\ncontinue with regular monitoring. Your follow-up appointment is scheduled for May 27, 2024, and we\n\nwill also plan for an EGD and HRCT to further assess your condition. Well check your CBC, CRP,\n\nLFTs, RFTs, and PT/INR on your next visit.\n\nPatient:\n\nOkay, Doctor. Im worried about the next steps, but I will follow the plan.\n\nDoctor:\n\nI understand your concerns, Umme Hani. It's important to stay positive and follow the treatment plan\n\nclosely.  We  will  continue  to  monitor  your  condition  and  provide  the  necessary  care.  Well  see  you\n\nagain soon. Do you have any questions for me?\n\n\fPatient:\n\nNot at the moment, Doctor. Ill see you at the next visit. Thank you.\n\nDoctor:\n\nYoure welcome. Take care of yourself, Umme Hani.\n\nPatient: Hello, doctor. Im here for my follow-up visit.\n\nDoctor:  Hi,  how  have  you  been  feeling  since  our  last  visit?  Lets  start  with  a  review  of  your  recent\n\ntests and reports.\n\nPatient: Im still having some issues with my liver, as you know. Im a bit concerned.\n\nDoctor: Lets go through everything. From the lab results on 30.03.2024, your IgG level is 7.7. Your\n\nceruloplasmin is at 29, and your 24-hour urinary copper is 10.55. We also have your iron levels at\n\n40, TIBC at 338, and ferritin at 102 from 13.01.2024. You were also tested for hepatitis B and C, and\n\nboth HBsAg and Anti-HCV are negative.\n\nPatient: Ive heard the term PELD/MELD before. What is that about?\n\nDoctor: Your PELD/MELD score is 16 points. This is a scoring system used to assess the severity of\n\nliver disease and help prioritize patients for a liver transplant.\n\n\fPatient: What about the MDT outcome?\n\nDoctor:  On  06.05.2024,  the  multidisciplinary  team  reviewed  your  case.  Radiologically  and\n\npathologically,  it  appears  theres  a  solitary  HCC  in  segment  II  of  your  liver.  Theres  no  vascular\n\ninvasion or extrahepatic disease at this time. Your liver disease doesnt have a clear etiology, but its\n\nfibrotic on histology. Given your presentation, were considering locoregional treatment for now, with\n\nfollow-up afterward.\n\nPatient: So, I do have cancer, right?\n\nDoctor: Yes, you have a well-differentiated hepatocellular carcinoma (HCC). The liver lesion biopsy\n\ndone  on  24.04.2024  confirmed  this.  It  shows  atypical  hepatocytes  with  prominent  nucleoli  and\n\nthickened  hepatic  plates.  Theres  also  steatosis  and  lobular  inflammation,  but  theres  no\n\nlymphovascular invasion.\n\nPatient: That sounds serious. What other biopsy results did we have?\n\nDoctor: We also did a liver parenchymal biopsy, and it showed chronic hepatitis and cirrhosis. There\n\nwas marked portal inflammation and ductular proliferation, along with moderate lobular inflammation\n\nand spotty necrosis. Macrovesicular steatosis was observed, and no cholestasis was present. The\n\nMetavir score for activity is A3/A3, and for fibrosis, it's F3-4/F4.\n\nPatient: I see. How does the liver look overall?\n\nDoctor:  From  the  ultrasound  shearwave  done  on  19.04.2024,  it  shows  an  F4  stage  of  hepatic\n\nfibrosis, which indicates severe scarring of the liver. Your AFP is 30.98, which is another important\n\nmarker we monitor for liver cancer.\n\n\fPatient: What about the endoscopy I had?\n\nDoctor: Your endoscopy results from 24.04.2024 show two columns of grade 3 esophageal varices\n\nwith  red  signs,  which  we  treated  by  applying  two  bands.  Additionally,  there  was  mild  gastropathy\n\nand  gastritis,  with  biopsies  taken  from  your  gastric  antrum.  The  duodenum  showed  decreased\n\nmucosal folds and duodenal ulcers in D1, and biopsies were also taken there. We reviewed these\n\nfindings during your follow-up on 30.07.2024.\n\nPatient: Were there any changes after that?\n\nDoctor: Yes, on 30.07.2024, during the follow-up endoscopy, the esophageal varices were reduced\n\nto one column of grade 1, with no red signs. The gastric findings remained similar with mild gastritis.\n\nYour duodenal ulcers in D1 were still present, but no new complications were found.\n\nPatient: What about the CT scan and HRCT results?\n\nDoctor:  The  CT  scan  triphasic  done  on  19.04.2024  confirmed  macronodular  cirrhosis  and  a  left\n\nhepatic  lobe  HCC.  The  HRCT  chest  from  04.06.2024  showed  clearance  of  the  ground-glass\n\ninfiltrates  we  previously  saw,  suggesting  the  resolution  of  an  infection.  Importantly,  there  were  no\n\nmetastatic deposits in the chest.\n\nPatient: Thats some good news, I guess. Whats the plan now, doctor?\n\nDoctor: The plan is to proceed with a liver transplant. Your family has decided to move forward with\n\na living donor liver transplant (LDLT), although a donor with the same blood group isnt available yet.\n\nWe will consult with anesthesia tomorrow morning for preparation.\n\n\fPatient: What medications should I be taking?\n\nDoctor:  Continue  with  the  medications:  Inderal  (Propanolol)  10  mg  twice  a  day,  Aldactone\n\n(Spironolactone) 25 mg three times a day. Were decreasing the Spironolactone dose to twice a day.\n\nIve also prescribed ORA ADE drops (5 drops once daily) and Vitamin D 2 lac units once daily for 1\n\nmonth (for a total of 3 doses).\n\nPatient: How often will I need follow-up?\n\nDoctor:  Well  have  another  follow-up  in  one  month.  During  that  visit,  well  repeat  your  lab  tests,\n\nincluding CBC, LFTs, RFTs, S/E, PT/INR, and urine C/E. Well also plan for another endoscopy.\n\nPatient: Thank you, doctor. I feel a bit reassured now.\n\nDoctor:  You're  welcome.  We're  closely  monitoring  your  condition,  and  well  continue  to  adjust  the\n\ntreatment as needed. Take care, and well see you soon for your follow-up.\n\nPatient:\n\nDoctor, Ive been feeling a bit weak lately, and my appetite has decreased. A few days ago, I had\n\nsome vomiting and loose stools, but I took some medicine from a nearby doctor, and now Im feeling\n\n\fbetter.\n\nDoctor:\n\nI see, let's go over your recent health status. Last time we discussed your liver condition. You have\n\nbeen diagnosed with well-differentiated hepatocellular carcinoma (HCC) on a background of cirrhotic\n\nliver. Let me check your latest examination results.\n\nDoctor:\n\nYou weigh 32 kg, which is below the 3rd centile for your age, and your height is 155 cm, at the 25th\n\ncentile. There's no jaundice, pallor, or edema. On your cardiovascular exam, your heart sounds are\n\nnormal, and your CNS is intact. Your respiratory exam is clear. The spleen is palpable by 1 cm, but\n\nyour liver is not palpable, and there is no evidence of ascites.\n\nPatient:\n\nIve been following the treatment plan. What does the doctor think about my condition now?\n\nDoctor:\n\nWe continue to monitor your liver condition closely. Youve had various tests, including a liver biopsy,\n\nendoscopy,  and  imaging.  Your  liver  biopsy  shows  chronic  hepatitis  and  cirrhosis  with  significant\n\nportal  inflammation,  moderate  lobular  inflammation,  and  steatosis.  The  AFP  (Alpha-Fetoprotein)  is\n\nelevated,  which  is  a  marker  for  liver  cancer.  Your  CT  scan  also  indicates  cirrhosis  and  a\n\nhepatocellular carcinoma in the left hepatic lobe.\n\nPatient:\n\nSo, whats the next step in my treatment?\n\nDoctor:\n\n\fGiven  your  diagnosis,  the  definitive  treatment  is  a  liver  transplant  (LDLT).  However,  we  are  still\n\nfacing  the  challenge  of  finding  a  compatible  donor  with  the  same  blood  type.  Your  family  has\n\ndecided to proceed with the liver transplant once a suitable donor is found. In the meantime, we'll\n\ncontinue your medications and monitor your liver function.\n\nPatient:\n\nWhat medications do I need to keep taking?\n\nDoctor:\n\nYou are prescribed the following:\n\nPropranolol (Inderal) 10 mg twice daily\n\nSpironolactone 25 mg twice daily\n\nORA ADE drops (5 drops once daily)\n\nVitamin D (2 lac units, once daily, for a month)\n\nOmeprazole 20 mg once daily\n\nEnsure formula milk for nutritional support\n\nSurbex Z (1 tablet once daily)\n\nVitamin K 2 mg twice weekly\n\n\fDoctor:\n\nYour liver condition requires close monitoring, so we will repeat all your labs and AFP levels at your\n\nnext  follow-up.  We  will  also  conduct  an  ultrasound  of  your  abdomen.  You  should  also  maintain  a\n\nhealthy diet and continue with the supplements as advised.\n\nPatient:\n\nWhat about my recent test results?\n\nDoctor:\n\nYour liver workup shows no autoimmune causes for your liver disease. All autoimmune markers are\n\nnegative,  including  anti-LKM-1,  ANA,  AMA,  and  ASMA.  Your  copper  and  ferritin  levels  are  within\n\nrange, and your liver enzymes are being monitored closely. Your PELD/MELD score is 16, indicating\n\nthe severity of your liver condition.\n\nYour CT scan shows macronodular cirrhosis, and the HRCT chest indicates clearance of previous\n\nlung infiltrates. There's no sign of metastasis.\n\nDoctor:\n\nBased on the multidisciplinary team meeting on 06.05.24, your liver disease is progressing, and we'll\n\nconsider locoregional treatments for now, alongside follow-up care.\n\nPatient:\n\nAnd when should I come for my next visit?\n\nDoctor:\n\nYou should follow up with us in about a month. In the meantime, well keep a close eye on your liver\n\nfunction and AFP levels. If a donor with the same blood group becomes available, we'll arrange for\n\n\fthe transplant. Weve also arranged for parent counseling to support your family during this process.\n\nPatient:\n\nThank you, doctor. Ill follow all the instructions and stay in touch for the follow-up.\n\nDoctor:\n\nYou're welcome. Keep in mind that we are here for any questions or concerns. Stay well, and well\n\nsee you in a month for your next follow-up.\n\n\f",
    "structured_data": {
        "PatientDemographics": {
            "Gender": "Female",
            "Age": "14",
            "MRN": "766532",
            "Diagnosis": "Hepatocellular Carcinoma"
        },
        "ClinicalSummary": {
            "ActiveSymptoms": [
                "weakness",
                "decreased appetite",
                "vomiting",
                "loose stools"
            ],
            "NegativeFindings": [
                "no jaundice",
                "no pallor",
                "no edema",
                "no ascites"
            ]
        },
        "DiagnosticConclusions": [
            "well-differentiated hepatocellular carcinoma (HCC)",
            "cirrhosis",
            "chronic hepatitis"
        ],
        "TherapeuticInterventions": {
            "Medications": [
                "Propranolol (Inderal) 10 mg twice daily",
                "Spironolactone 25 mg twice daily",
                "ORA ADE drops (5 drops once daily)",
                "Vitamin D (2 lac units, once daily, for a month)",
                "Omeprazole 20 mg once daily",
                "Ensure formula milk for nutritional support",
                "Surbex Z (1 tablet once daily)",
                "Vitamin K 2 mg twice weekly",
                "Ceclor 500 mg twice a day for 5 days",
                "Azithromycin 250 mg once a day for 3 days"
            ],
            "Procedures": [
                "liver biopsy",
                "endoscopy",
                "ultrasound",
                "CT scan",
                "HRCT",
                "living donor liver transplant (LDLT)"
            ]
        },
        "DiagnosticEvidence": {
            "ImagingFindings": [
                "coarse cirrhotic liver with a focal lesion in the left lobe",
                "macronodular cirrhosis",
                "clearance of ground-glass infiltrates in HRCT"
            ],
            "LabResults": [
                "bilirubin 1.6 mg/dL",
                "ALT 93",
                "ALP 990",
                "albumin 2.7 g/dL",
                "INR 1.9",
                "AFP 30.98",
                "IgG level 7.7",
                "ceruloplasmin 29",
                "24-hour urinary copper 10.55",
                "iron levels 40",
                "TIBC 338",
                "ferritin 102"
            ],
            "PathologyFindings": [
                "mild interface hepatitis",
                "portal tract fibrosis stage 1",
                "chronic hepatitis",
                "marked portal inflammation",
                "ductular proliferation",
                "moderate lobular inflammation",
                "macrovesicular steatosis",
                "no cholestasis",
                "Metavir score A3/A3 for activity, F3-4/F4 for fibrosis"
            ]
        },
        "ChronicConditions": {
            "ChronicDiseases": [
                "Hepatocellular Carcinoma",
                "cirrhosis"
            ],
            "Comorbidities": []
        },
        "Follow-upPlan": {
            "PlannedConsultations": [
                "anesthesia consultation for transplant preparation"
            ],
            "ScheduledTests": [
                "CBC",
                "LFTs",
                "RFTs",
                "S/E",
                "PT/INR",
                "urine C/E",
                "ultrasound of abdomen"
            ],
            "NextAppointmentDetails": [
                "May 27, 2024"
            ]
        },
        "VisitTimeline": [
            "April 18, 2024 - first visit to pediatric gastroenterology clinic",
            "January 31, 2024 - liver biopsy",
            "April 13, 2024 - ultrasound",
            "April 24, 2024 - liver lesion biopsy",
            "June 4, 2024 - HRCT chest",
            "July 30, 2024 - follow-up endoscopy"
        ],
        "SummaryNarrative": {
            "ClinicalCourseProgression": "The patient's liver condition has been closely monitored, with a diagnosis of well-differentiated HCC on a background of cirrhosis.",
            "DiagnosticJourney": "Multiple tests including imaging and biopsies have confirmed the presence of HCC and chronic liver disease.",
            "TreatmentResponse": "The patient is currently on a treatment plan that includes medications and is awaiting a suitable donor for liver transplant.",
            "OngoingConcerns": "The patient expresses concerns about her cancer diagnosis and the need for a compatible donor for the transplant."
        }
    }
}