{
    "patient_id": "history_physical_59",
    "raw_text": "Gender: Male\n\nAge: 49\n\nMRN: 751795\n\nDiagnosis: Cholangiocarcinoma\n\nHistory and Physical:\n\nPatient:\n\nDoctor, I've been dealing with jaundice for the last two months, along with some abdominal pain.\n\nDoctor:\n\nI see. Can you tell me more about your medical history? Do you have any conditions like diabetes or\n\nhypertension?\n\nPatient:\n\nNo, I dont have diabetes or hypertension. I don't have any significant medical history, except for a\n\npast surgery on my left inguinal hernia about 20 years ago. Unfortunately, I don't have the records\n\nfor that.\n\nDoctor:\n\nUnderstood.  Have  you  experienced  any  other  symptoms  like  fever,  night  sweats,  or  significant\n\nweight loss?\n\nPatient:\n\nNo,  I  havent  had  any  fever  or  night  sweats,  and  I  havent  experienced  any  significant  weight  loss\n\neither.\n\nDoctor:\n\nWhat about any bleeding symptoms like hematemesis or melena?\n\n\fPatient:\n\nNo, nothing like that.\n\nDoctor:\n\nAlright, based on your symptoms and previous examinations, weve been reviewing your CT scans.\n\nYou had a CT scan on the 19th of September, which showed a mass involving the confluence of the\n\nhepatic  ducts,  along  with  some  mild  to  moderate  intrahepatic  biliary  stasis.  This  finding  was\n\nsuggestive  of  a  possible  neoplastic  process,  like  cholangiocarcinoma.  Have  you  been  informed\n\nabout the CT results?\n\nPatient:\n\nYes,  I  was  told  about  the  CT  results.  They  mentioned  a  mass  near  the  porta  hepatis  measuring\n\n4.2x5x3.8 cm, and there was some enlargement of the liver and spleen.\n\nDoctor:\n\nCorrect.  The  mass  appears  to  involve  the  segment  4  extending  to  segment  2,  and  theres\n\nhepatosplenomegaly  with  a  mildly  dilated  portal  vein.  Your  lab  results  from  October  15th  show\n\nelevated  bilirubin  levelstotal  bilirubin  was  7.6  mg/dL  and  direct  bilirubin  was  7.2  mg/dL,  indicating\n\nsome liver dysfunction. Your liver enzymes, ALT and AST, are also elevated, but your albumin level\n\nwas still relatively normal at 4.4.\n\nPatient:\n\nI see.\n\nDoctor:\n\nOn November 1st, another CT scan was done, which further confirmed the presence of intrahepatic\n\n\fcholangiocarcinoma.  This  mass  is  involving  the  left  lobe  of  your  liver  and  extending  into  the  left\n\nhepatic duct and common hepatic duct. Theres also moderate biliary dilatation.\n\nPatient:\n\nWhat does that mean for me?\n\nDoctor:\n\nIt means the cancer is confined to the left lobe and hasn't spread to other parts like the right side of\n\nthe  liver,  and  theres  no  metastatic  disease  at  this  point.  During  a  multidisciplinary  team  (MDT)\n\ndiscussion  on  November  2nd,  we  decided  to  proceed  with  a  plan  to  treat  it  through  surgery.  The\n\nrecommended procedure is a left hepatectomy, where the left side of the liver will be removed, along\n\nwith \n\nthe  excision  of \n\nthe  biliary \n\ntree,  an  extended \n\nlymphadenectomy,  and  a  Roux-en-Y\n\nhepaticojejunostomy.\n\nPatient:\n\nWhat are the chances of success with this surgery?\n\nDoctor:\n\nThis surgery carries a 5-10% risk of death due to complications, but its the best option to remove the\n\ncancer.  However,  there  are  risks  like  infection,  liver  failure,  or  even  the  possibility  of  remaining\n\ncancer  if  the  disease  has  spread  to  areas  not  visible  yet.  If  we  find  metastatic  spread  during  the\n\nsurgery, we would stop the procedure, take a biopsy, and refer you to oncology for chemotherapy.\n\nPatient:\n\nWhat if the cancer has spread?\n\nDoctor:\n\n\fIf  the  cancer  has  spread  to  the  right  hepatic  duct,  we  would  still  proceed  with  the  Roux-en-Y,  but\n\nchemotherapy would be necessary after the surgery. As with any surgery for cancer, there's always\n\na possibility of recurrence, even after removal.\n\nPatient:\n\nThat sounds intense. Could I try ERCP with stenting instead?\n\nDoctor:\n\nERCP  with  stenting  may  help  temporarily  relieve  jaundice,  but  its  not  a  curative  treatment.  The\n\ncancer would remain, and it may not provide long-term relief. Given the seriousness of the condition,\n\nsurgery is still the preferred option.\n\nPatient:\n\nI need some time to think about it.\n\nDoctor:\n\nTake all the time you need. It's a big decision, and I encourage you to discuss it with your family.\n\nOnce you've made your decision, please come back for a follow-up.\n\nPatient:\n\nI will, thank you.\n\nDoctor:\n\nIn  the  meantime,  we  will  continue  to  manage  your  symptoms.  Ill  prescribe  medication  to  help  with\n\nthe jaundice and manage your liver function. Youll take cap urso 250 mg three times a day, ciproxin\n\n500  mg  twice  a  day  for  one  week,  and  Peptamin  powder.  Well  also  need  to  monitor  your  liver\n\nfunction with regular lab tests, and Ive ordered a Fibroscan to check for liver fibrosis, as you have a\n\n\fhistory of alcohol use.\n\nPatient:\n\nI understand. Thank you for explaining everything to me.\n\nDoctor:\n\nYou're welcome. We'll continue monitoring your condition closely and adjust our plan as needed. If\n\nyou have any questions in the meantime, dont hesitate to reach out.\n\nFollow-up Visit (November 15, 2023)\n\nPatient:\n\nDoctor, Ive been continuing the medications, but Im still experiencing jaundice.\n\nDoctor:\n\nYes, your CT scan shows the same findings as before. The mass is still confined to the left lobe and\n\ncommon  bile  ducts,  with  no  metastatic  spread.  Your  liver  function  tests  have  worsened  a  bityour\n\ntotal bilirubin has risen to 20, and your albumin has dropped to 3.8, which indicates worsening liver\n\nfunction.\n\nPatient:\n\nWhat does this mean for my treatment plan?\n\nDoctor:\n\nWe  will  proceed  with  the  surgery  as  planned,  but  your  liver  function  is  something  we  need  to\n\naddress carefully. Your Fibroscan results show cirrhosis (F4) and severe steatosis (S3), indicating\n\nsignificant  liver  damage.  This  may  affect  your  recovery,  so  well  need  to  monitor  your  condition\n\n\fclosely during the surgery and after.\n\nPatient:\n\nWill the surgery still go ahead?\n\nDoctor:\n\nYes, we are still planning for the surgery, but we will need to keep your liver function in mind. The\n\nsurgery remains the best option to treat the cholangiocarcinoma, and well do our best to minimize\n\nany complications.\n\nPatient:\n\nAlright, Ill follow through with the plan.\n\nDoctor:\n\nGreat. Well make sure everything is in place before your surgery. If you have any more questions or\n\nconcerns, dont hesitate to reach out.\n\nPatient:\n\nThank you for all your help, Doctor.\n\nDoctor:\n\nYou're welcome. Were here to support you through this.\n\n\f",
    "structured_data": {
        "PatientDemographics": {
            "Gender": "Male",
            "Age": "49",
            "MRN": "751795",
            "Diagnosis": "Cholangiocarcinoma"
        },
        "ClinicalSummary": {
            "ActiveSymptoms": [
                "jaundice",
                "abdominal pain"
            ],
            "NegativeFindings": [
                "no diabetes",
                "no hypertension",
                "no fever",
                "no night sweats",
                "no significant weight loss",
                "no bleeding symptoms"
            ]
        },
        "DiagnosticConclusions": [
            "mass involving the confluence of the hepatic ducts",
            "mild to moderate intrahepatic biliary stasis",
            "intrahepatic cholangiocarcinoma",
            "hepatosplenomegaly",
            "mildly dilated portal vein",
            "cirrhosis (F4)",
            "severe steatosis (S3)"
        ],
        "TherapeuticInterventions": {
            "Medications": [
                "cap urso 250 mg three times a day",
                "ciproxin 500 mg twice a day for one week",
                "Peptamin powder"
            ],
            "Procedures": [
                "left hepatectomy",
                "excision of the biliary tree",
                "extended lymphadenectomy",
                "Roux-en-Y hepaticojejunostomy"
            ]
        },
        "DiagnosticEvidence": {
            "ImagingFindings": [
                "CT scan on September 19th showing mass measuring 4.2x5x3.8 cm",
                "CT scan on November 1st confirming intrahepatic cholangiocarcinoma"
            ],
            "LabResults": [
                "total bilirubin 7.6 mg/dL",
                "direct bilirubin 7.2 mg/dL",
                "elevated liver enzymes ALT and AST",
                "albumin level 4.4",
                "total bilirubin 20",
                "albumin 3.8"
            ],
            "PathologyFindings": []
        },
        "ChronicConditions": {
            "ChronicDiseases": [],
            "Comorbidities": [
                "history of alcohol use",
                "past surgery on left inguinal hernia"
            ]
        },
        "Follow-upPlan": {
            "PlannedConsultations": [],
            "ScheduledTests": [
                "Fibroscan"
            ],
            "NextAppointmentDetails": [
                "Follow-up visit on November 15, 2023"
            ]
        },
        "VisitTimeline": [
            "Initial visit",
            "Follow-up visit on November 15, 2023"
        ],
        "SummaryNarrative": {
            "ClinicalCourseProgression": "Patient has been experiencing jaundice and abdominal pain, with worsening liver function.",
            "DiagnosticJourney": "CT scans revealed a mass suggestive of cholangiocarcinoma, confirmed by subsequent imaging.",
            "TreatmentResponse": "Patient is on medications but continues to experience jaundice.",
            "OngoingConcerns": "Worsening liver function and the need for careful monitoring during surgery."
        }
    }
}