{
    "patient_id": "history_physical_36",
    "raw_text": "Gender: Female\n\nAge: 12\n\nMRN: 781852\n\nDiagnosis: Budd-Chiari syndrome\n\nHistory and Physical:\n\nPatient:\n\nDoctor, I was referred here for a liver transplant, but let me tell you more about my situation. About\n\n3.5  months  ago,  I  started  having  abdominal  distension.  I  was  initially  treated  in  Vihari,  and  I  was\n\nfound to have low hemoglobin, so I was transfused with 3 PCVs. Later, I was referred to CHL, where\n\nthey diagnosed me with Budd-Chiari syndrome based on a CT scan. Now Ive been referred to PKLI\n\nfor a liver transplant evaluation.\n\nDoctor:\n\nI see, that sounds quite serious. You mentioned abdominal distension and your hemoglobin being\n\nlow. Have you had any other symptoms?\n\nPatient:\n\nYes, I also have jaundice and ascites. Apart from that, nothing else really.\n\nDoctor:\n\nOkay, let's go over your medical history. Anything notable there?\n\nPatient:\n\nNo,  everything  is  normal.  I  was  born  via  C-section  at  term,  and  everything  went  fine.  Ive  had  no\n\nmajor surgeries, and my family history is unremarkable. I am on a salt-free diet, and my vaccinations\n\nare up to date.\n\n\fDoctor:\n\nGood to hear. Now, Ill check your examination details. You are 148 cm tall and weigh 35 kg, which\n\nis  above  the  10th  percentile  for  height  but  below  the  5th  percentile  for  weight.  Your  jaundice  and\n\npallor are visible. No edema though, which is good. Your liver is 7 cm below the costal margin, hard\n\nconsistency,  and  your  spleen  is  slightly  enlarged.  Your  abdominal  veins  are  dilated,  and  there's\n\nshifting dullness.\n\nPatient:\n\nYes, thats what I feel too.\n\nDoctor:\n\nLets  review  your  lab  results.  The  bilirubin  levels  were  0.87  and  now  1.6.  Your  hemoglobin  has\n\ndropped from 9.8 to 4.62. Your platelet count was 201, and now its 115. Your sodium and potassium\n\nlevels are somewhat low, and your albumin is at 3.2. Well need to follow up on these levels closely.\n\nPatient:\n\nOkay, doctor. I trust you. Whats the plan moving forward?\n\nDoctor:\n\nWere going to run a few more tests, including CBC, liver function tests, renal function tests, and viral\n\nserology. Well also test for protein C, protein S, anti-thrombin III, and check your blood group. Ill also\n\norder  an  ultrasound  today  and  a  CT  triphasic  on  Monday,  as  well  as  an  ultrasound  shearwave  if\n\ntheres no ascites. Ill need to see you for a follow-up on Monday. Youll stay on your salt-free diet for\n\nnow, and we may schedule an EGD on Tuesday if the lab results are normal.\n\nYour current medications include:\n\n\fORA AD: 4 drops once daily\n\nSpironolactone 25mg: 3 times daily\n\nK-Lot injection 5mg: once weekly\n\nInderal 10mg: 3 times daily\n\nDoes that sound alright?\n\nPatient:\n\nYes, thats fine. Thank you.\n\nPatient Visit: 29.07.24 - Follow-up Visit in Paediatric Gastroenterology\n\nPatient:\n\nDoctor, Im here for my follow-up. Ive been doing okay, no major complaints right now.\n\nDoctor:\n\nGlad to hear that. Let me check your details again. Your height is still above the 10th percentile, but\n\nyour weight remains below the 5th percentile. Jaundice and pallor are still present, but no edema.\n\nYour  liver  is  now  6  cm  below  the  costal  margin,  and  the  consistency  is  still  hard.  You  still  have\n\ndilated superficial veins, and your spleen is enlarged by 6 cm with shifting dullness.\n\nPatient:\n\nYes, I noticed the same.\n\n\fDoctor:\n\nWeve reviewed your lab results. Your WBC is 6.69, hemoglobin has dropped further to 6.5, and your\n\nplatelet count is 198. Your protein C, protein S, and anti-thrombin III levels are still low, with values\n\nof 67, 75, and 84, respectively. Well need to address these and monitor closely.\n\nPatient:\n\nWhat does that mean, doctor?\n\nDoctor:\n\nIt means we need to keep monitoring your clotting factors and ensure were addressing any issues\n\nthere. Ive also reviewed your CT triphasic and ultrasound results. The CT scan still shows features\n\nconsistent with Budd-Chiari syndrome, with some mild to moderate ascites. Your ultrasound shows\n\nhepatosplenomegaly, altered liver parenchyma, and caudate lobe hypertrophy.\n\nPatient:\n\nIt seems quite complicated.\n\nDoctor:\n\nYes, it is, but we have a solid plan. We will consult with the anesthesia team before proceeding with\n\nany  procedures.  Well  also  need  to  transfuse  300  ml  of  packed  RBCs  and  administer  furosemide\n\nduring the transfusion. Im also planning an ultrasound shearwave for you.\n\nPatient:\n\nThat sounds good, doctor. I trust your plan.\n\nDoctor:\n\nYoull continue on the current medications:\n\n\fORA AD: 4 drops once daily\n\nSpironolactone 25 mg: 3 times daily\n\nK-Lot injection 5 mg: once weekly\n\nInderal 10 mg: 3 times daily\n\nOmeprazole 30 mg: once daily\n\nEvion 1 capsule: once daily\n\nWell also start furosemide 5 mg twice daily and continue with a salt-free diet.\n\nPatient:\n\nThank you, doctor. Ill follow your instructions.\n\nPatient Visit: 27.08.24 - Follow-up Visit in Paediatric Gastroenterology\n\nPatient:\n\nDoctor, Im back for another follow-up. I feel okay, no major issues.\n\nDoctor:\n\nGood to hear. Lets check your details. Your height is still above the 10th percentile, but your weight\n\nis  still  below  the  5th  percentile.  Your  jaundice  is  mild,  and  your  pallor  is  still  present.  There's  no\n\nedema. Your liver is now 3-4 cm below the costal margin, with hard consistency. The spleen is 10\n\n\fcm below the costal margin, and there's shifting dullness, with mild ascites.\n\nPatient:\n\nYes, thats accurate.\n\nDoctor:\n\nLets  go  over  your  lab  results.  Your  hemoglobin  is  still  low  at  6.5,  but  your  platelet  count  has\n\nremained stable at 198. The INR is 1.04, and the levels of protein C, protein S, and anti-thrombin III\n\nare still low.\n\nPatient:\n\nI see. What does this mean for me?\n\nDoctor:\n\nIt means that we need to continue closely monitoring your clotting factors and anemia. Weve also\n\nreviewed  your  CT  and  ultrasound  findings,  and  theyre  still  suggestive  of  Budd-Chiari  syndrome.\n\nThere's no focal hepatic lesion, but you still have moderate ascites.\n\nPatient:\n\nWhats the next step, doctor?\n\nDoctor:\n\nWell  continue  monitoring  your  condition  with  further  tests.  An  EGD  was  done,  and  the  results\n\nshowed normal mucosa with grade 1 varices. Your current medications are:\n\nORA AD: 4 drops once daily\n\n\fSpironolactone 50 mg: twice daily\n\nK-Lot injection 5 mg: once weekly\n\nInderal 10 mg: 3 times daily\n\nOmeprazole 30 mg: once daily\n\nEvion 1 capsule: once daily\n\nFurosemide 5 mg: twice daily\n\nFor now, well maintain this regimen, and Id like to follow up with a USG shearwave today. Well also\n\ndiscuss  the  possibility  of  starting  Rivaroxaban,  and  you'll  continue  with  your  salt-free  diet.  Please\n\ncome back in 3 months.\n\nPatient:\n\nThank you so much, doctor. I will follow your advice.\n\n\f",
    "structured_data": {
        "PatientDemographics": {
            "Gender": "Female",
            "Age": "12",
            "MRN": "781852",
            "Diagnosis": "Budd-Chiari syndrome"
        },
        "ClinicalSummary": {
            "ActiveSymptoms": [
                "abdominal distension",
                "jaundice",
                "ascites"
            ],
            "NegativeFindings": [
                "no major surgeries",
                "no edema"
            ]
        },
        "DiagnosticConclusions": [
            "Budd-Chiari syndrome",
            "hepatosplenomegaly",
            "altered liver parenchyma",
            "caudate lobe hypertrophy"
        ],
        "TherapeuticInterventions": {
            "Medications": [
                "ORA AD: 4 drops once daily",
                "Spironolactone 25 mg: 3 times daily",
                "K-Lot injection 5 mg: once weekly",
                "Inderal 10 mg: 3 times daily",
                "Omeprazole 30 mg: once daily",
                "Evion 1 capsule: once daily",
                "Furosemide 5 mg: twice daily"
            ],
            "Procedures": [
                "liver transplant evaluation",
                "CBC",
                "liver function tests",
                "renal function tests",
                "viral serology",
                "ultrasound",
                "CT triphasic",
                "ultrasound shearwave",
                "EGD"
            ]
        },
        "DiagnosticEvidence": {
            "ImagingFindings": [
                "CT scan shows features consistent with Budd-Chiari syndrome",
                "ultrasound shows hepatosplenomegaly, altered liver parenchyma, and caudate lobe hypertrophy"
            ],
            "LabResults": [
                "bilirubin levels: 0.87 to 1.6",
                "hemoglobin: 9.8 to 4.62",
                "platelet count: 201 to 115",
                "WBC: 6.69",
                "hemoglobin: 6.5",
                "platelet count: 198",
                "protein C: 67",
                "protein S: 75",
                "anti-thrombin III: 84",
                "INR: 1.04"
            ],
            "PathologyFindings": []
        },
        "ChronicConditions": {
            "ChronicDiseases": [
                "Budd-Chiari syndrome"
            ],
            "Comorbidities": []
        },
        "Follow-upPlan": {
            "PlannedConsultations": [
                "anesthesia team"
            ],
            "ScheduledTests": [
                "ultrasound shearwave",
                "follow-up lab tests"
            ],
            "NextAppointmentDetails": [
                "follow-up in 3 months"
            ]
        },
        "VisitTimeline": [
            "29.07.24 - Follow-up Visit in Paediatric Gastroenterology",
            "27.08.24 - Follow-up Visit in Paediatric Gastroenterology"
        ],
        "SummaryNarrative": {
            "ClinicalCourseProgression": "Patient has shown ongoing symptoms of jaundice and ascites with fluctuating hemoglobin levels.",
            "DiagnosticJourney": "Patient was diagnosed with Budd-Chiari syndrome after initial treatment for low hemoglobin and abdominal distension.",
            "TreatmentResponse": "Patient is on a regimen of medications and has had multiple follow-ups with monitoring of lab results.",
            "OngoingConcerns": "Continued monitoring of clotting factors and hemoglobin levels is necessary."
        }
    }
}