{
    "patient_id": "history_physical_50",
    "raw_text": "Gender: Male\n\nAge: 66\n\nMRN: 764547\n\nDiagnosis: Cholangiocarcinoma\n\nHistory and Physical:\n\nPatient:\n\nHello, Doctor. I'm here today with my son, Mr. Aamir, who is doing his PhD in Biochemistry. I live in\n\nMirpur, AJK.\n\nDoctor:\n\nWelcome! I see you're experiencing some concerns. Can you tell me more about what brings you in\n\ntoday?\n\nPatient:\n\nYes,  Ive  been  dealing  with  a  few  issues  recently.  Ive  had  significant  weight  loss,  about  12-15\n\nkilograms, but I havent been able to track it properly. I also havent been able to sleep much, and my\n\nappetite is nearly gone. On top of that, Ive been experiencing central chest pain.\n\nDoctor:\n\nI see. Have you noticed any other symptoms, like fevers or night sweats?\n\nPatient:\n\nNo, I havent had any fevers or night sweats. Also, there have been no signs of physical or cognitive\n\nlimitations.\n\nDoctor:\n\nThats good to hear. Lets move on to your medical history. I see that you have uncontrolled diabetes\n\n\fand have been diagnosed with APD. Is that right?\n\nPatient:\n\nYes,  that's  correct.  Ive  been  managing  diabetes,  but  its  not  well  controlled.  Also,  I  had  an  open\n\nappendectomy back in 1980, and I have no known allergies.\n\nDoctor:\n\nThank you for that information. Do you have any social or lifestyle habits I should be aware of?\n\nPatient:\n\nI live with my family in Mirpur, AJK. I have a BA degree and used to work as a shopkeeper, but Im\n\nnot working anymore. I used to smoke but quit seven years ago. I dont drink alcohol.\n\nDoctor:\n\nGot  it.  Id  like  to  review  your  recent  medical  tests.  You  had  some  investigations  done  recently,\n\ncorrect?\n\nPatient:\n\nYes, I did. I had an OGD on 10th February 2024 at SIH Islamabad, where the report showed two\n\nlymph nodes at the porta hepatis, the largest one measuring 1.3 x 1.4 cm. They didnt find any mass\n\nat the porta hepatis, but they took a biopsy.\n\nDoctor:\n\nAnd what did the biopsy show?\n\nPatient:\n\nThe biopsy showed no evidence of malignancy. It contained fragmented lymphoid tissue made up of\n\n\fmature lymphocytes.\n\nDoctor:\n\nI see. You also had a CT scan on 7th February 2024. What did the imaging report indicate?\n\nPatient:\n\nThe CT scan showed mild hepatomegaly, a subtle soft tissue fullness at the confluence of the right\n\nand left hepatic ducts, mild to moderate intrahepatic bile duct dilation, and a thrombosed left portal\n\nvein.  It  also  mentioned  some  prominent  upper  abdominal  nodes.  The  features  suggested\n\ncholangiocarcinoma, along with diffuse meso-omenteric congestion.\n\nDoctor:\n\nThank you for sharing that. Now, lets look at your recent lab results:\n\nHB: 12.9\n\nTLC: 8.5\n\nPLT: 187\n\nT-BIL: 1.63 (on 7th Feb) and 2.3 (on 14th March)\n\nD-BIL: 1.48 (on 7th Feb) and 1.6 (on 14th March)\n\nALT/AST: 72/81 (on 7th Feb) and 41/60 (on 14th March)\n\nALP: 442 (on 7th Feb) and 482 (on 14th March)\n\n\fAlbumin: Not available\n\nCreatinine: 0.62\n\nNa+: 139\n\nK+: 3.9\n\nINR: 0.98\n\nAFP: Not available\n\nCA 19-9: 406\n\nCEA: 0.6\n\nTSH: 2.20\n\nIgG4 Studies: Normal\n\nECOG: 0\n\nHep B and C: Negative\n\nDoctor:\n\nYour  liver  function  tests  show  some  elevated  bilirubin  levels,  especially  the  total  bilirubin,  which  is\n\n\fconcerning. Your CA 19-9 is also elevated, which can be associated with biliary diseases. However,\n\nyour  overall  condition  doesnt  indicate  any  immediate  critical  issues  for  now.  How  are  you  feeling\n\noverall?\n\nPatient:\n\nIve been feeling weak, but theres no major pain or discomfort right now. The chest pain has been\n\nmore occasional.\n\nDoctor:\n\nThank  you  for  updating  me  on  your  condition.  Based  on  everything  we  have  reviewed  so  far,  it\n\nseems  you  have  locally  advanced  cholangiocarcinoma,  and  the  left  lobe  of  your  liver  is  atrophic.\n\nTheres also involvement of the right posterior artery, and mild narrowing of the main portal vein.\n\nPatient:\n\nWhat does this mean for me, Doctor?\n\nDoctor:\n\nSince the disease is locally advanced, you are not a surgical candidate at the moment. However, we\n\nneed to further investigate to ensure we have a clear understanding of the situation. Id recommend\n\na fresh CT scan from PKLI, and then we can discuss it in the multidisciplinary team (MDT) meeting\n\nto finalize the next steps.\n\nPatient:\n\nWhat will the next steps involve?\n\nDoctor:\n\nAfter the fresh CT scan, well meet with the MDT to decide on the best treatment plan. Ill also have\n\n\fyou meet with our coordinator, Asif, who will help facilitate any required services for you.\n\nFollow-Up Visit - 10/07/2024\n\nPatient:\n\nIm here for my follow-up visit. How is my condition now?\n\nDoctor:\n\nAfter  reviewing  your  situation,  its  clear  that  your  cholangiocarcinoma  is  still  locally  advanced,  and\n\nyou are not a suitable candidate for surgical resection. Your liver function tests have improved, and\n\nyour ECOG status is now at 1, indicating mild symptoms but not debilitating ones.\n\nPatient:\n\nSo, what is the plan now?\n\nDoctor:\n\nIn  light  of  the  locally  advanced  disease,  I  suggest  proceeding  with  an  ERCP  using  a  spyglass,\n\nfollowed  by  a  biopsy  for  further  analysis.  Once  we  have  the  biopsy  results,  we  will  refer  you  to\n\noncology  as  per  the  MDTs  decision  for  a  definitive  diagnosis  and  treatment  plan.  I  will  also\n\nrecommend holding urso therapy for now.\n\nPatient:\n\nAlright, Doctor. Thank you for explaining everything so clearly.\n\n\f",
    "structured_data": {
        "PatientDemographics": {
            "Gender": "Male",
            "Age": "66",
            "MRN": "764547",
            "Diagnosis": "Cholangiocarcinoma"
        },
        "ClinicalSummary": {
            "ActiveSymptoms": [
                "significant weight loss",
                "insomnia",
                "loss of appetite",
                "central chest pain",
                "weakness"
            ],
            "NegativeFindings": [
                "no fevers",
                "no night sweats",
                "no signs of physical or cognitive limitations"
            ]
        },
        "DiagnosticConclusions": [
            "locally advanced cholangiocarcinoma",
            "left lobe of liver atrophic",
            "involvement of right posterior artery",
            "mild narrowing of main portal vein"
        ],
        "TherapeuticInterventions": {
            "Medications": [
                "urso therapy (on hold)"
            ],
            "Procedures": [
                "ERCP using spyglass",
                "biopsy"
            ]
        },
        "DiagnosticEvidence": {
            "ImagingFindings": [
                "mild hepatomegaly",
                "subtle soft tissue fullness at confluence of right and left hepatic ducts",
                "mild to moderate intrahepatic bile duct dilation",
                "thrombosed left portal vein",
                "prominent upper abdominal nodes"
            ],
            "LabResults": [
                {
                    "HB": "12.9"
                },
                {
                    "TLC": "8.5"
                },
                {
                    "PLT": "187"
                },
                {
                    "T-BIL": "1.63 (on 7th Feb), 2.3 (on 14th March)"
                },
                {
                    "D-BIL": "1.48 (on 7th Feb), 1.6 (on 14th March)"
                },
                {
                    "ALT/AST": "72/81 (on 7th Feb), 41/60 (on 14th March)"
                },
                {
                    "ALP": "442 (on 7th Feb), 482 (on 14th March)"
                },
                {
                    "Creatinine": "0.62"
                },
                {
                    "Na+": "139"
                },
                {
                    "K+": "3.9"
                },
                {
                    "INR": "0.98"
                },
                {
                    "CA 19-9": "406"
                },
                {
                    "CEA": "0.6"
                },
                {
                    "TSH": "2.20"
                },
                {
                    "IgG4 Studies": "Normal"
                },
                {
                    "ECOG": "0"
                },
                {
                    "Hep B and C": "Negative"
                }
            ],
            "PathologyFindings": [
                "biopsy showed no evidence of malignancy, contained fragmented lymphoid tissue made up of mature lymphocytes"
            ]
        },
        "ChronicConditions": {
            "ChronicDiseases": [
                "uncontrolled diabetes"
            ],
            "Comorbidities": [
                "APD",
                "history of open appendectomy"
            ]
        },
        "Follow-upPlan": {
            "PlannedConsultations": [
                "oncology referral after biopsy results"
            ],
            "ScheduledTests": [
                "fresh CT scan from PKLI"
            ],
            "NextAppointmentDetails": [
                "Follow-up visit on 10/07/2024"
            ]
        },
        "VisitTimeline": [
            {
                "Date": "10th February 2024",
                "Event": "OGD performed"
            },
            {
                "Date": "7th February 2024",
                "Event": "CT scan performed"
            },
            {
                "Date": "14th March 2024",
                "Event": "Lab tests performed"
            },
            {
                "Date": "10/07/2024",
                "Event": "Follow-up visit"
            }
        ],
        "SummaryNarrative": {
            "ClinicalCourseProgression": "Cholangiocarcinoma remains locally advanced with improved liver function tests.",
            "DiagnosticJourney": "Initial imaging and biopsy led to the diagnosis of cholangiocarcinoma.",
            "TreatmentResponse": "Patient's ECOG status improved to 1, indicating mild symptoms.",
            "OngoingConcerns": "Patient is not a surgical candidate and requires further investigation and treatment planning."
        }
    }
}