{
    "patient_id": "history_physical_73",
    "raw_text": "Gender: Male\n\nAge: 66\n\nMRN: 797552\n\nDiagnosis: Hepatocellular Carcinoma\n\nHistory and Physical:\n\nPatient: Doctor, Ive been experiencing severe pain in my right upper quadrant (RUQ) and itching all\n\nover my body for the past three weeks. Its been really bothering me, along with some diarrhea.\n\nDoctor:  I  understand.  Let  me  ask  you  some  more  details.  You've  had  hepatitis  B  (HBV)  for  many\n\nyears, is that correct?\n\nPatient: Yes, Ive had HBV since 2008, and Ive been treated with DAAs. However, the last time I had\n\na  PCR  test  for  hepatitis  B,  it  came  back  positive.  The  result  from  August  6,  2024,  showed  a  viral\n\nload of 216,811 IU/mL.\n\nDoctor: Okay, thank you for sharing that. Regarding your symptoms of RUQ pain and itching, well\n\nneed  to  look  into  your  condition  closely.  Have  you  experienced  any  of  the  following  symptoms\n\nrecentlyvomiting blood, swelling in your abdomen, jaundice, or black stools?\n\nPatient:  No,  none  of  those.  I  havent  had  any  bleeding,  and  my  weight  loss  is  not  documented.  I\n\nhavent had any fevers or night sweats either.\n\nDoctor: I see. And do you have any history of blood transfusions or any previous surgeries?\n\nPatient: No, I dont have any history of blood transfusions or surgeries.\n\nDoctor: Alright. And do you know if youre allergic to any medications?\n\n\fPatient: Im allergic to some medications, but Im not sure exactly which ones.\n\nDoctor: Noted. I see you're currently taking Entecavir 0.5mg once daily. Is that correct?\n\nPatient: Yes, thats correct.\n\nDoctor:  Lets  also  take  a  look  at  your  general  health.  Do  you  have  any  financial  strains  or  cultural\n\nneeds I should be aware of for your care?\n\nPatient: Yes, I have some financial issues, and I am uneducated. I work as a farmer and Im married\n\nwith  three  children.  I  used  to  use  Naswaar  for  20  years  but  have  stopped  using  it  for  the  past  20\n\nyears.\n\nDoctor: Thank you for sharing that. It seems your family history is unremarkable, and there are no\n\nsignificant psychological concerns, is that right?\n\nPatient: Yes, thats correct. No depression or suicidal thoughts, and no history of self-harm.\n\nDoctor: Good to know. Lets move on to your physical exam. You seem well-oriented and conscious,\n\nwith  no  issues  in  speech,  cognition,  or  mobility.  Your  physical  exam  shows  a  soft,  non-tender,\n\nnon-distended abdomen, and normal lung and heart sounds.\n\nPatient: Yes, that sounds right.\n\nDoctor: Ive reviewed your recent investigations, including your CT scan from August 12, 2024. The\n\nscan  shows  an  arterially  enhancing  lesion  in  the  right  hepatic  lobe  with  washout  on  subsequent\n\n\fphases, which suggests hepatocellular carcinoma (HCC). Theres also a right renal cortical cyst, but\n\nno evidence of cirrhosis.\n\nPatient: Thats concerning. What does this mean for me?\n\nDoctor: The diagnosis of HCC is concerning, but were not seeing any vascular invasion in your liver.\n\nWell  need  to  consider  treatment  options.  A  possible  treatment  is  Radiofrequency  Ablation  (RFA),\n\nand  well  discuss  with  interventional  radiology  if  this  is  suitable  for  you.  Ill  also  continue  your\n\nEntecavir  for  hepatitis  B,  but  well  adjust  the  treatment  plan  after  we  complete  the  ablation  or\n\nresection.\n\nPatient: I understand. Whats the plan for now?\n\nDoctor:  We  need  to  repeat  some  investigations.  I  recommend  getting  a  fresh  CT  scan  and\n\nperforming  the  remaining  baseline  tests.  Once  we  have  those  results,  well  plan  the  next  steps,\n\nincluding possible surgery or RFA. Lets follow up after these investigations.\n\nFollow-up Visit (20-08-24)\n\nPatient:  Doctor,  Im  back  for  my  follow-up.  The  pain  in  my  RUQ  is  still  troubling  me,  and  Ive  had\n\nsome nausea and diarrhea as well. Ive been on Entecavir as per the last plan.\n\nDoctor: Its good to see you again. From what I understand, youve been on Entecavir for your HBV,\n\nand  we  had  discussed  a  possible  procedure  for  the  HCC.  The  CT  scan  you  had  on  August  12\n\nshowed  a  lesion  in  your  liver.  It  was  confirmed  as  HCC,  and  were  now  considering  RFA.  Did  you\n\nhave any significant changes since the last visit?\n\n\fPatient: I havent noticed anything new, except for the ongoing pain and some discomfort from the\n\nitching.\n\nDoctor:  Alright,  we  will  refer  you  to  interventional  radiology  for  the  RFA  procedure,  and  I  want  to\n\nensure  we  manage  the  pain  effectively.  Ill  add  pain  relief  medication  as  well,  including  Tramadol\n\n50mg twice daily, and well continue monitoring your liver function.\n\nPatient: Thank you, Doctor.\n\nDoctor:  You're  welcome.  We'll  continue  the  Entecavir,  and  after  RFA,  we'll  reassess  the  hepatitis\n\ntreatment.  Lets  also  plan  a  follow-up  in  about  four  weeks  to  check  on  your  progress  and  repeat\n\nsome lab tests, including your AFP levels and a new HBV PCR.\n\nFollow-up Visit (11-09-24)\n\nDoctor: How have you been feeling since your last visit?\n\nPatient: The pain is still there, but Ive been managing it with the medication. My liver function tests\n\nwere high last time, but now theyve improved.\n\nDoctor: Good to hear. Your latest tests from August 19 show improvements in your liver function, but\n\nthe  AFP  levels  are  still  elevated  at  220.  Were  still  looking  at  the  3.5  cm  HCC  without  vascular\n\ninvasion.  The  microwave  ablation  procedure  was  delayed  due  to  high  liver  enzymes,  but  it  seems\n\nwere moving forward now.\n\nPatient: Yes, Im hoping the procedure will help with the pain.\n\n\fDoctor: Absolutely, well monitor you closely after the procedure. The liver function is improving, and\n\nwell reassess your CT scan and AFP levels soon. In the meantime, continue with your medications,\n\nand follow-up in a month.\n\nFollow-up Visit (25-10-24)\n\nPatient: Im here for my follow-up visit. The pain has improved, but Im still concerned about the HCC.\n\nDoctor: I understand your concern. Youve had your microwave ablation on September 26, and your\n\nliver  function  tests  have  improved  since  then.  Your  AFP  remains  elevated  at  220,  but  your  liver\n\nfunction tests are showing positive changes.\n\nPatient: Yes, I noticed some improvement, but the pain is still lingering.\n\nDoctor:  Thats  expected,  but  we  will  continue  monitoring.  Your  CT  scan  from  September  19\n\nconfirmed  the  3.5  cm  HCC  with  no  vascular  invasion.  No  extrahepatic  metastasis  was  found.  The\n\nnext  steps  are  to  follow  up  with  another  AFP  test  and  a  PCR  for  HBV  in  three  months.  We'll  also\n\nrepeat a CT scan in two weeks to monitor the situation.\n\nPatient: Thank you, Doctor. I appreciate your help.\n\nDoctor:  Youre  welcome.  Continue  your  Entecavir,  and  lets  touch  base  in  a  month  for  your  next\n\nfollow-up. We'll adjust the plan as necessary.\n\nConsultant Addendum (25-10-24)\n\nDoctor: Ive reviewed the care plan and agree with the steps weve taken so far. Keep up with your\n\n\fmedications and follow-up as scheduled.\n\nFollow-up Visit (20-12-24)\n\nDoctor: I see youre here for your reports. How have you been feeling since your last visit?\n\nPatient:  The  pain  has  decreased,  but  I  still  have  some  discomfort.  Ive  been  on  Entecavir,  and  the\n\nmicrowave ablation was done in September.\n\nDoctor:  Your  HCC  was  treated  with  microwave  ablation,  and  your  liver  function  is  improving.  The\n\nAFP remains at 220, and were awaiting the results of your next AFP test. Well also repeat the HBV\n\nPCR  in  three  months.  The  plan  is  to  follow  up  after  two  weeks  with  another  CT  scan  and  further\n\nblood work to assess the situation.\n\nPatient: Ill continue with the medications and follow-up as instructed.\n\nDoctor:  Thats  the  best  approach.  We'll  keep  monitoring  your  progress  closely.  Lets  meet  again  in\n\ntwo weeks for the follow-up on the CT and AFP levels.\n\n\f",
    "structured_data": {
        "PatientDemographics": {
            "Gender": "Male",
            "Age": "66",
            "MRN": "797552",
            "Diagnosis": "Hepatocellular Carcinoma"
        },
        "ClinicalSummary": {
            "ActiveSymptoms": [
                "severe pain in right upper quadrant",
                "itching all over body",
                "diarrhea",
                "nausea"
            ],
            "NegativeFindings": [
                "vomiting blood",
                "swelling in abdomen",
                "jaundice",
                "black stools",
                "weight loss",
                "fevers",
                "night sweats"
            ]
        },
        "DiagnosticConclusions": [
            "Hepatocellular carcinoma confirmed",
            "No evidence of cirrhosis",
            "No vascular invasion"
        ],
        "TherapeuticInterventions": {
            "Medications": [
                "Entecavir 0.5mg once daily",
                "Tramadol 50mg twice daily"
            ],
            "Procedures": [
                "Radiofrequency Ablation",
                "Microwave Ablation"
            ]
        },
        "DiagnosticEvidence": {
            "ImagingFindings": [
                "CT scan shows arterially enhancing lesion in right hepatic lobe",
                "CT scan confirmed 3.5 cm HCC with no vascular invasion"
            ],
            "LabResults": [
                "PCR test positive with viral load of 216,811 IU/mL",
                "AFP levels elevated at 220",
                "Liver function tests improved"
            ],
            "PathologyFindings": []
        },
        "ChronicConditions": {
            "ChronicDiseases": [
                "Hepatitis B"
            ],
            "Comorbidities": []
        },
        "Follow-upPlan": {
            "PlannedConsultations": [
                "Interventional radiology for RFA"
            ],
            "ScheduledTests": [
                "Repeat CT scan",
                "AFP test",
                "HBV PCR"
            ],
            "NextAppointmentDetails": [
                "Follow-up in four weeks",
                "Follow-up in two weeks for CT and AFP levels"
            ]
        },
        "VisitTimeline": [
            "Initial visit on 20-08-24",
            "Follow-up on 11-09-24",
            "Follow-up on 25-10-24",
            "Follow-up on 20-12-24"
        ],
        "SummaryNarrative": {
            "ClinicalCourseProgression": "Patient experienced ongoing pain and discomfort, with improvements in liver function tests after microwave ablation.",
            "DiagnosticJourney": "Diagnosis of HCC confirmed through imaging and lab results, with treatment options discussed.",
            "TreatmentResponse": "Patient's liver function improved post-ablation, but AFP levels remain elevated.",
            "OngoingConcerns": "Patient continues to experience pain and is concerned about HCC."
        }
    }
}