{
    "patient_id": "history_physical_31",
    "raw_text": "Gender: Female\n\nAge: 5\n\nMRN: 709356\n\nDiagnosis: Budd-Chiari syndrome\n\nHistory and Physical:\n\nPatient: Ive been dealing with abdominal distension, jaundice, fever, and decreased urine output for\n\nabout a month now.\n\nDoctor:  I  see.  Lets  take  a  look  at  the  results  from  your  initial  visit  on  6th  October  2022.  Your  lab\n\nresults  show  elevated  ALT  and  AST  levels,  with  ALT  at  485  and  AST  at  195.  Your  bilirubin  is\n\nelevated at 2.4, with a direct bilirubin of 1.5. Also, your liver function markers are a bit off, with an\n\nALP of 801 and GGT at 54.\n\nPatient: Yes, the doctor mentioned that the liver is impacted. I also see that my hemoglobin was low\n\nat 7.7, and my white blood cell count was high at 14.1. What does all this mean?\n\nDoctor: Your hemoglobin is low, which could explain the pallor youre experiencing. The high white\n\nblood cell count suggests some infection or inflammation. We also see some coagulation issues with\n\nan INR of 1.3, which is a bit elevated. Your albumin is also low at 2.9, which could be a sign of liver\n\ndysfunction.\n\nPatient: Oh, I see. What did the imaging show?\n\nDoctor: The ultrasound from September showed signs of veno-occlusive syndrome. Your CT scan\n\nfrom  1st  October  2022  showed  hepatomegaly  with  heterogeneous  density,  hypertrophy  of  the\n\ncaudate  lobe,  and  non-visualization  of  the  hepatic  veins,  which  strongly  suggests  Budd-Chiari\n\nsyndrome.\n\n\fPatient: And what are the next steps for me?\n\nDoctor: For now, I recommend continuing your current medications, including Aldactone, Lasoride,\n\nand Ibert. We also need to check for any further liver damage and submit a CD of your CT scan for\n\nfurther review. Lets schedule a virtual clinic tomorrow for follow-up.\n\nPatient: Its been a while since my last visit. Im back for a follow-up. I still have abdominal distension,\n\nand Im still on the same medications. My weight is 15.2 kg, and Im from Sahiwal.\n\nDoctor: Its good to see you again. Your abdominal distension has been ongoing for 2 months, and it\n\nseems that your condition is still being managed with Aldactone and Ibert. On examination, theres\n\nno  jaundice  or  pallor,  but  your  abdomen  remains  soft  and  non-tender  with  a  liver  palpable  3  cm\n\nbelow the costal margin.\n\nPatient: Ive heard of Budd-Chiari syndrome. Is that still the diagnosis?\n\nDoctor:  Yes,  based  on  your  imaging  findings,  the  diagnosis  remains  Budd-Chiari  syndrome.  Well\n\nneed to monitor your liver function closely. Ive ordered some more tests, including a full CBC, liver\n\nfunction tests, and coagulation profiles like protein C and anti-thrombin III. Additionally, well check\n\nfor any infections or viral activity with tests for HAV and HEV.\n\nPatient: Okay, what else is planned?\n\nDoctor: Ive prescribed Vitamin K injections weekly, along with Maltofer for iron supplementation and\n\nVermox  for  any  possible  parasitic  infections.  Ill  also  start  you  on  Spiromide  to  help  manage  fluid\n\nretention. Well discuss the findings after your CT scan CD submission. Lets see you again in one\n\n\fmonth.\n\nPatient: I'm back for my follow-up. Ive been experiencing abdominal distension for 2 months again.\n\nMy current weight is 15.2 kg.\n\nDoctor: Thank you for coming in. Your blood tests from December 2022 show that your bilirubin is\n\nnow  1.5,  ALT  is  27,  and  AST  is  57.  Your  liver  function  is  relatively  stable,  but  we  still  need  to  be\n\ncautious since youve had multiple episodes of abdominal distension.\n\nPatient: What else do we need to address?\n\nDoctor:  In  addition  to  your  liver  markers,  your  coagulation  profile  shows  that  your  INR  is  slightly\n\nelevated  at  1.8,  and  protein  C  levels  are  lower  than  normal.  Its  important  we  manage  this  with\n\nVitamin  K  supplementation  and  other  treatments.  Ive  added  Inderal  to  help  control  any  blood\n\npressure concerns. We still need to check for liver biopsy and possibly an endoscopy to get a better\n\nlook at any varices.\n\nPatient: Sounds like theres still a lot to do.\n\nDoctor: Yes, but youre responding well to treatment. Lets continue with the current medications and\n\nprepare for the next steps. Well schedule another follow-up after the liver biopsy and EGD, and well\n\nmonitor your condition closely.\n\nPatient: Its been almost a year now. Im back for my follow-up. Im currently 4 years old and weigh 18\n\nkg.  My  abdominal  distension  is  worse,  and  Im  also  dealing  with  ascites,  jaundice,  and  a  few\n\nepisodes of vomiting blood.\n\n\fDoctor: I see that youve had a tough time recently. Youve been experiencing jaundice and severe\n\nascites. Your physical examination shows generalized edema, pallor, and hyperemic mucosa. The\n\nliver is enlarged, and your spleen is not palpable.\n\nPatient: Is it still Budd-Chiari syndrome?\n\nDoctor: Yes, your CT scan from 1st October 2022 and ultrasound from April 2024 confirm that the\n\nliver damage is consistent with Budd-Chiari syndrome. Youve had several complications with blood\n\nclots  and  varices,  as  seen  in  your  endoscopy  in  September  2024,  where  we  applied  3  bands  to\n\ncontrol the varices.\n\nPatient: How can we treat this now?\n\nDoctor:  You  need  to  be  on  continuous  management,  including  Spironolactone  for  fluid  retention,\n\nLasoride  for  your  ascites,  and  Vitamin  K  injections.  Weve  started  you  on  Propanolol  to  help  with\n\nblood  pressure  and  prevent  bleeding.  We  also  need  to  ensure  you  receive  ongoing  care  at  a\n\nchildrens  hospital  where  they  can  optimize  your  medical  treatment.  Given  the  severity,  a  liver\n\ntransplant is still the most definitive treatment, but we need to review your financial situation before\n\nproceeding.\n\nPatient: What should I do now?\n\nDoctor:  Continue  with  the  current  medications  and  refer  to  the  childrens  hospital  for  the  required\n\ntreatment  optimization.  After  the  financial  screening,  we  can  discuss  further  plans,  including\n\npotential liver transplant options.\n\nPatient: Thank you for the care, Doctor. Ill follow your instructions.\n\n\fDoctor: You're welcome. Well continue monitoring you closely and take the necessary steps for your\n\ncare.\n\n\f",
    "structured_data": {
        "PatientDemographics": {
            "Gender": "Female",
            "Age": "5",
            "MRN": "709356",
            "Diagnosis": "Budd-Chiari syndrome"
        },
        "ClinicalSummary": {
            "ActiveSymptoms": [
                "abdominal distension",
                "jaundice",
                "fever",
                "decreased urine output",
                "ascites",
                "vomiting blood"
            ],
            "NegativeFindings": [
                "no jaundice",
                "no pallor"
            ]
        },
        "DiagnosticConclusions": [
            "Budd-Chiari syndrome"
        ],
        "TherapeuticInterventions": {
            "Medications": [
                "Aldactone",
                "Lasoride",
                "Ibert",
                "Vitamin K injections",
                "Maltofer",
                "Vermox",
                "Spiromide",
                "Inderal",
                "Propanolol"
            ],
            "Procedures": [
                "CT scan",
                "ultrasound",
                "endoscopy"
            ]
        },
        "DiagnosticEvidence": {
            "ImagingFindings": [
                "veno-occlusive syndrome",
                "hepatomegaly with heterogeneous density",
                "hypertrophy of the caudate lobe",
                "non-visualization of the hepatic veins",
                "generalized edema",
                "enlarged liver",
                "varices"
            ],
            "LabResults": [
                "elevated ALT at 485",
                "elevated AST at 195",
                "elevated bilirubin at 2.4",
                "direct bilirubin at 1.5",
                "ALP at 801",
                "GGT at 54",
                "low hemoglobin at 7.7",
                "high white blood cell count at 14.1",
                "INR at 1.3",
                "low albumin at 2.9",
                "bilirubin at 1.5",
                "ALT at 27",
                "AST at 57",
                "INR at 1.8",
                "lower than normal protein C levels"
            ],
            "PathologyFindings": []
        },
        "ChronicConditions": {
            "ChronicDiseases": [
                "Budd-Chiari syndrome"
            ],
            "Comorbidities": []
        },
        "Follow-upPlan": {
            "PlannedConsultations": [
                "children's hospital for treatment optimization"
            ],
            "ScheduledTests": [
                "full CBC",
                "liver function tests",
                "coagulation profiles",
                "tests for HAV and HEV",
                "liver biopsy",
                "endoscopy"
            ],
            "NextAppointmentDetails": [
                "follow-up in one month"
            ]
        },
        "VisitTimeline": [
            "Initial visit on 6th October 2022",
            "Follow-up in December 2022",
            "Follow-up in April 2024",
            "Follow-up in September 2024"
        ],
        "SummaryNarrative": {
            "ClinicalCourseProgression": "The patient has experienced ongoing abdominal distension, jaundice, and ascites, with worsening symptoms over time.",
            "DiagnosticJourney": "The diagnosis of Budd-Chiari syndrome was confirmed through imaging and lab results.",
            "TreatmentResponse": "The patient is responding to treatment but continues to experience complications.",
            "OngoingConcerns": "The need for continuous management and potential liver transplant due to severity."
        }
    }
}