{
    "patient_id": "history_physical_71",
    "raw_text": "Gender: Female\n\nAge: 49\n\nMRN: 819357\n\nDiagnosis: Hepatocellular Carcinoma\n\nHistory and Physical:\n\nPatient:\n\nDoctor,  I  came  in  because  I  noticed  a  mass  on  the  right  side  of  my  abdomen.  It  was  found\n\nincidentally during an ultrasound that was done as part of my workup for GERD and APD.\n\nDoctor:\n\nAlright, let me take a look at your records. So, you've had a history of GERD and APD for the past\n\neight  years,  correct?  Also,  I  see  that  your  Anti-HCV  and  HBsAg  were  negative  three  years  ago,\n\nwhich is good.\n\nPatient:\n\nYes,  that's  right.  I  haven't  experienced  any  symptoms  like  hematemesis,  ascites,  jaundice,  or\n\nmelena.  I  also  havent  had  any  significant  weight  loss  or  required  blood  transfusions.  No  fever  or\n\nnight sweats either.\n\nDoctor:\n\nThat's  helpful  to  know.  I  see  you  have  a  history  of  being  diabetic  and  hypertensive,  but  you're\n\ncompliant  with  your  medications.  You \n\ntake  Thyroxin,  Amlodipine,  Telmisartan,  and\n\nSitagliptin/Metformin. Is that correct?\n\nPatient:\n\nYes, Ive been taking those as prescribed. Also, I have no allergies.\n\n\fDoctor:\n\nGreat,  let's  talk  about  your  family  history.  I  can  see  that  your  father  had  Ewing  sarcoma  and\n\ncolorectal cancer. Do you have any other family members with significant health conditions?\n\nPatient:\n\nNo, that's the only notable family history.\n\nDoctor:\n\nAlright.  I  see  there  are  no  psychological  concerns,  and  you're  not  experiencing  any  cognitive  or\n\nphysical limitations. Your general health seems to be in good shape.\n\nPatient:\n\nYes, I don't have any issues with language, speech, vision, or mobility.\n\nDoctor:\n\nNow, let's take a look at your lab results and imaging. Your ultrasound from August 12th showed a\n\nfatty liver with moderate hepatomegaly, and a solid mass measuring 10 x 9.8 cm, inseparable from\n\nthe liver. The CT scan from August 16th shows a large exophytic mass arising from the inferior edge\n\nof  segment  VI  extending  into  the  subhepatic  space.  This  feature  suggests  it  could  be  a  primary\n\nhepatocellular  lesion  of  the  fibrolamellar  variety  or  possibly  a  neuroendocrine  tumor.  However,\n\nmetastatic disease is unlikely.\n\nPatient:\n\nSo, is it something malignant?\n\nDoctor:\n\nIt  could  be,  but  the  biopsy  performed  on  August  28th  didnt  show  any  malignant  cells.  The  biopsy\n\n\frevealed  unremarkable  liver  parenchyma  with  fibrosis  and  dilated  vessels,  so  it's  possible  that  the\n\nsample was taken from the perilesional area. There's also a chance that this mass could represent\n\nfocal nodular hyperplasia.\n\nPatient:\n\nThats a relief to hear. What are the next steps?\n\nDoctor:\n\nI agree, its encouraging, but we still need to be cautious. Well need to submit the CD of the CT scan\n\ndone from outside for further analysis. The MRI liver dynamics will also be important for discussion\n\nin  the  multidisciplinary  team  (MDT)  meeting.  Based  on  the  results,  were  planning  for  a  wedge\n\nresection of the tumor.\n\nPatient:\n\nWhen can I expect to get more details?\n\nDoctor:\n\nWell follow up with the MDTs decision on Tuesday. Your brother has already been informed about\n\nyour current disease status, and he was given detailed information. The next step will be based on\n\nthat outcome.\n\n(Follow-Up Visit - 19/09/24)\n\nPatient:\n\nIve brought the CD of my CT scan as requested.\n\nDoctor:\n\n\fLets  take  a  look.  The  CT  scan  shows  a  large  exophytic  mass  arising  from  the  inferior  edge  of\n\nsegment VI, extending into the subhepatic space. The size is approximately 11 x 9.9 x 9.8 cm. It still\n\nappears to be a primary hepatocellular lesion, potentially fibrolamellar, but we need to rule out other\n\npossibilities.\n\nPatient:\n\nWhat did the biopsy show?\n\nDoctor:\n\nThe core biopsy from August 28th showed unremarkable liver parenchyma with fibrosis and dilated\n\nvessels.  This  suggests  the  biopsy  was  taken  from  the  perilesional  area,  or  it  could  indicate  focal\n\nnodular hyperplasia, not malignancy.\n\nPatient:\n\nWhats next?\n\nDoctor:\n\nThe next step will be to submit the CD of the CT scan done from outside. Well also be discussing\n\nthe case in the MDT meeting and planning for a wedge resection of the tumor. Well also conduct an\n\nMRI liver dynamics study for further evaluation.\n\nPatient:\n\nWhat do you think the outcome will be?\n\nDoctor:\n\nWell have a clearer picture after the MDT discussion. The lesion could be benign, but we need to\n\nrule out other possibilities. Well proceed with the wedge resection if necessary.\n\n\f(Follow-Up Call - 24/09/24)\n\nDoctor:\n\nHello, this is the follow-up regarding your case. The MDT outcome was discussed, and the plan is to\n\nmove forward with the wedge resection of the tumor. Well need to schedule the surgery soon.\n\nPatient:\n\nThank you for keeping me updated. What are the next steps for surgery?\n\nDoctor:\n\nWe will review the MRI results, finalize the surgical plan, and prepare you for the wedge resection. Ill\n\nschedule the surgery after we review the MRI.\n\nLab Results:\n\nTest(cid:9)31/05/24(cid:9)13/08/24\n\nHb(cid:9)10.4(cid:9)11.0\n\nWBC(cid:9)7.0(cid:9)7.6\n\nPLTS(cid:9)338(cid:9)349\n\nTotal-BILI(cid:9)0.3(cid:9)0.3\n\nDirect-BILI(cid:9)0.1(cid:9)0.1\n\nALT/AST(cid:9)36/28(cid:9)36/28\n\nAlk. Phos.(cid:9)97(cid:9)97\n\nAlbumin(cid:9)4.3(cid:9)4.3\n\nCreatinine(cid:9)0.6(cid:9)0.6\n\nNa+(cid:9)-(cid:9)-\n\n\fK+(cid:9)-(cid:9)-\n\nINR(cid:9)-(cid:9)-\n\nAFP(cid:9)-(cid:9)-\n\nMELD(cid:9)-(cid:9)-\n\nCTP(cid:9)-(cid:9)-\n\nTSH(cid:9)4.44(cid:9)4.82\n\n\f",
    "structured_data": {
        "PatientDemographics": {
            "Gender": "Female",
            "Age": "49",
            "MRN": "819357",
            "Diagnosis": "Hepatocellular Carcinoma"
        },
        "ClinicalSummary": {
            "ActiveSymptoms": [
                "None"
            ],
            "NegativeFindings": [
                "No hematemesis",
                "No ascites",
                "No jaundice",
                "No melena",
                "No significant weight loss",
                "No blood transfusions",
                "No fever",
                "No night sweats"
            ]
        },
        "DiagnosticConclusions": [
            "Possible primary hepatocellular lesion",
            "Possibly fibrolamellar",
            "Possibly neuroendocrine tumor",
            "Metastatic disease unlikely",
            "Focal nodular hyperplasia possible"
        ],
        "TherapeuticInterventions": {
            "Medications": [
                "Thyroxin",
                "Amlodipine",
                "Telmisartan",
                "Sitagliptin/Metformin"
            ],
            "Procedures": [
                "Wedge resection of the tumor",
                "MRI liver dynamics study"
            ]
        },
        "DiagnosticEvidence": {
            "ImagingFindings": [
                "Ultrasound showed fatty liver with moderate hepatomegaly and a solid mass measuring 10 x 9.8 cm",
                "CT scan shows a large exophytic mass measuring 11 x 9.9 x 9.8 cm"
            ],
            "LabResults": [
                {
                    "Test": "Hb",
                    "31/05/24": "10.4",
                    "13/08/24": "11.0"
                },
                {
                    "Test": "WBC",
                    "31/05/24": "7.0",
                    "13/08/24": "7.6"
                },
                {
                    "Test": "PLTS",
                    "31/05/24": "338",
                    "13/08/24": "349"
                },
                {
                    "Test": "Total-BILI",
                    "31/05/24": "0.3",
                    "13/08/24": "0.3"
                },
                {
                    "Test": "Direct-BILI",
                    "31/05/24": "0.1",
                    "13/08/24": "0.1"
                },
                {
                    "Test": "ALT/AST",
                    "31/05/24": "36/28",
                    "13/08/24": "36/28"
                },
                {
                    "Test": "Alk. Phos.",
                    "31/05/24": "97",
                    "13/08/24": "97"
                },
                {
                    "Test": "Albumin",
                    "31/05/24": "4.3",
                    "13/08/24": "4.3"
                },
                {
                    "Test": "Creatinine",
                    "31/05/24": "0.6",
                    "13/08/24": "0.6"
                },
                {
                    "Test": "TSH",
                    "31/05/24": "4.44",
                    "13/08/24": "4.82"
                }
            ],
            "PathologyFindings": [
                "Biopsy from August 28th showed unremarkable liver parenchyma with fibrosis and dilated vessels"
            ]
        },
        "ChronicConditions": {
            "ChronicDiseases": [
                "GERD",
                "APD",
                "Diabetes",
                "Hypertension"
            ],
            "Comorbidities": [
                "None"
            ]
        },
        "Follow-upPlan": {
            "PlannedConsultations": [
                "MDT meeting"
            ],
            "ScheduledTests": [
                "MRI liver dynamics study"
            ],
            "NextAppointmentDetails": [
                "Follow up with MDT decision on Tuesday"
            ]
        },
        "VisitTimeline": [
            {
                "Date": "19/09/24",
                "Details": "Follow-up visit to discuss CT scan and biopsy results"
            },
            {
                "Date": "24/09/24",
                "Details": "Follow-up call regarding MDT outcome and surgical plan"
            }
        ],
        "SummaryNarrative": {
            "ClinicalCourseProgression": "Patient presented with a mass found incidentally during ultrasound.",
            "DiagnosticJourney": "Multiple imaging studies and a biopsy were performed to evaluate the mass.",
            "TreatmentResponse": "Biopsy did not show malignancy, but further evaluation is needed.",
            "OngoingConcerns": "Need to rule out malignancy and plan for surgical intervention."
        }
    }
}