{
    "patient_id": "history_physical_52",
    "raw_text": "Gender: Male\n\nAge: 26\n\nMRN: 815506\n\nDiagnosis: Cholangiocarcinoma\n\nHistory and Physical:\n\nPatient:  Ive  been  feeling  unwell  for  the  past  four  months.  I  developed  yellowing  of  my  eyes,  my\n\nstools  became  pale,  and  my  urine  turned  dark.  Along  with  that,  I  have  been  experiencing\n\ngeneralized itching.\n\nDoctor: I see. How long have these symptoms been ongoing?\n\nPatient: It started around four months ago, and things have gotten progressively worse since then.\n\nAbout a month ago, I had jaundice, and my bilirubin levels were very higharound 54.5.\n\nDoctor:  It  seems  like  your  jaundice  has  been  persistent.  You  mentioned  that  you  underwent  an\n\nERCP during this time?\n\nPatient:  Yes,  I  did.  Unfortunately,  the  procedure  didnt  go  well.  It  was  abandoned  because  they\n\ncouldnt fix the issue. After that, I was admitted to the hospital for PTBD, which was performed at the\n\nMilitary Hospital. However, after the procedure, I had complications, including an upper GI bleed. I\n\nwas then referred for angioplasty and embolization of the gastroduodenal artery.\n\nDoctor: That sounds like a challenging few weeks. How long were you hospitalized?\n\nPatient: I was hospitalized from July 18th to August 6th.\n\nDoctor:  Understood.  Lets  go  over  some  of  your  other  symptoms.  Have  you  experienced  any\n\n\fhematemesis  (vomiting  blood),  ascites  (fluid  buildup  in  the  abdomen),  or  any  episodes  of  hepatic\n\nencephalopathy (confusion due to liver failure)?\n\nPatient: No, I havent had any vomiting blood, ascites, or confusion. The only thing Ive been dealing\n\nwith is jaundice.\n\nDoctor: Good to know. Have you had any significant weight loss recently?\n\nPatient: Yes, Ive lost about 15 kilograms over the past four months.\n\nDoctor: Thats quite significant. Have you had any blood transfusions due to this weight loss?\n\nPatient: Yes, I had 5 pints of blood transfused because of my low hemoglobin levels.\n\nDoctor: Were you experiencing any fevers or night sweats?\n\nPatient: No, I havent had any fevers or night sweats.\n\nDoctor: Alright, let's move on to your past medical and surgical history. Do you have any history of\n\nmajor health conditions or surgeries?\n\nPatient: No, I havent had any significant medical issues or surgeries in the past.\n\nDoctor: Thats helpful to know. Do you have any known allergies?\n\nPatient: No, I dont have any allergies.\n\n\fDoctor: What medications are you currently taking?\n\nPatient:  Im  on  the  following  medications:  Cap  Urso  250mg  twice  daily,  Risek  40mg  once  daily,\n\nMotilium  10mg  three  times  daily,  Qalsan-D  once  daily,  Ensure  milk  powder  6  tablespoons  twice\n\ndaily, and Beneprotein twice daily.\n\nDoctor: Thank you for sharing that. Have you taken any other medications in the past?\n\nPatient:  Yes,  I  was  on  injections  of  Ceftriaxone  2gms  once  daily  for  seven  days,  Vitamin  K  once\n\ndaily for three days, and Hepamerz syrup twice daily.\n\nDoctor: Got it. Lets now talk about your social history. Do you have any cultural or spiritual needs\n\nthat we should consider in your care?\n\nPatient: No, I dont have any special cultural or spiritual needs.\n\nDoctor: Alright. What about your financial situation? Are there any strains you are facing?\n\nPatient: Yes, Ive been facing some financial difficulties. I was working as an executive at a telecom\n\ncompany in Islamabad, but I had to quit my job four months ago due to my health.\n\nDoctor:  I  see.  How  about  your  family?  Do  you  have  any  family  history  of  diseases  like  diabetes,\n\nhypertension, cancer, tuberculosis, or asthma?\n\nPatient: My father passed away in July 2020 due to pulmonary tuberculosis and liver disease, but\n\nthe exact cause wasnt known.\n\n\fDoctor: Im sorry to hear about your father. Lets talk about your psychological health. Have you been\n\nfeeling depressed or had any suicidal thoughts recently?\n\nPatient: No, I havent felt depressed, and I dont have any suicidal thoughts.\n\nDoctor: Thats good to hear. Now, moving on to your physical health, do you have any issues with\n\nlanguage, speech, vision, or mobility?\n\nPatient: No, I dont have any impairments in those areas.\n\nDoctor: Great. Now lets go over your physical exam findings. Your consciousness is intact, and you\n\nare  well-oriented  with  a  Glasgow  Coma  Scale  of  15/15.  On  examination,  your  heart  sounds  are\n\nnormal with no murmurs, your respiratory system shows normal vesicular breathing bilaterally, and\n\nyour abdomen is soft, non-tender, and non-distended.\n\nPatient: Thats correct.\n\nDoctor:  Moving  on  to  the  investigations,  you  had  an  ERCP  on  July  11th,  and  it  showed  a  tight\n\nmid-CBD stricture. The procedure had to be abandoned due to complications. You then had a PTBD\n\non  July  13th,  which  showed  severe  stenosis  at  the  distal  CBD  level  and  required  an  internal  and\n\nexternal catheter placement.\n\nPatient: Yes, thats accurate. After the PTBD, I also had a transcatheter angiogram and embolization\n\nof the gastroduodenal artery due to an iatrogenic duodenal injury.\n\nDoctor: Exactly. A CT scan was done on July 18th, which showed signs of liver infarctions, biloma\n\nformation, and splenic infarctions with super-added infection. There was also significant intrahepatic\n\n\fcholestasis  and  moderate  ascites.  The  most  recent  CT  scan  showed  mild  intrahepatic  biliary\n\ndilatation and splenic infarction.\n\nPatient: Yes, I recall those findings.\n\nDoctor: Your lab results show elevated total bilirubin levels, which have decreased over time. Your\n\nrecent bilirubin level was 1.0, and your albumin levels are gradually improving. Your liver enzymes\n\nare also fluctuating, but theyre improving with time. You have a low BMI of 16.2, which we need to\n\naddress.\n\nPatient: Ive noticed my albumin levels improving, but my weight is still low.\n\nDoctor: Yes, nutritional rehabilitation is important for you to gain weight in preparation for possible\n\nsurgery. Your ECOG score is currently 1, which means you are fairly well but still need to focus on\n\nyour nutrition. We will be monitoring your weight closely.\n\nPatient: Understood.\n\nDoctor:  Based  on  your  diagnosis  and  history,  we  suspect  that  the  mid-CBD  stricture  and  the\n\ncommon  hepatic  duct  stricture  could  be  due  to  an  autoimmune  cause,  possibly  related  to  IgG4\n\ndisease. However, the data is not yet conclusive to start any specific treatment.\n\nPatient: I understand. What are the next steps?\n\nDoctor: The next step would be to proceed with nutritional rehabilitation. You need to increase your\n\nBMI to above 18.5 to prepare for surgery. We will also discuss your case in the MDT to determine\n\nwhether  surgery  or  steroid  therapy  is  the  best  option.  Ill  refer  you  to  Dr.  Ahmad  Karim,  a\n\n\fgastroenterologist,  for  his  opinion  on  steroid  therapy.  We  will  also  order  systemic  IgG4  levels  to\n\nfurther investigate the autoimmune aspect.\n\nPatient: Okay, Ill focus on improving my nutrition.\n\nDoctor:  Once  your  nutrition  improves  and  your  BMI  reaches  the  target,  we  will  reevaluate  the\n\nsituation. We will follow up after a month to assess the results of the steroid therapy trial and review\n\nthe MDT decision. We will keep you updated on the next steps.                                                           \n\n                             Patient:\n\nI  was  doing  fine  about  four  months  ago,  but  then  I  suddenly  developed  progressive  jaundice.  My\n\nbilirubin levels went up to 54.5, so I had an ERCP, but that didn't work. Afterward, I was admitted to\n\nQuad  e  Azam  International  Hospital  for  a  Percutaneous  Transhepatic  Biliary  Drainage  (PTBD)\n\nprocedure. That was done by Military Hospital, but after the procedure, I had a major complication \n\nan  upper  GI  bleed,  and  I  ended  up  vomiting  blood.  I  was  referred  for  a  repeat  PTBD  and\n\nembolization of the gastroduodenal artery. I stayed in the hospital from July 18th to August 6th.\n\nI also had hepatitis B and C screenings, and both came back negative.\n\nOver the last few months, I've lost about 15 kg of weight, and I had to get 5 pints of blood transfused\n\ndue to low hemoglobin levels.\n\nRight now, I'm not taking any medication.\n\nDoctor:\n\nThat sounds like quite a difficult period. Let me review the details.\n\nYou had an ERCP on July 11th, where a tight mid-common bile duct (CBD) stricture was identified,\n\nbut the procedure had to be abandoned. Then, on July 13th, the PTBD was done, and the findings\n\nincluded  a  dilated  left-sided  duct  and  severe  stenosis  at  the  distal  CBD  level.  Both  external  and\n\n\finternal  catheters  were  placed.  Afterward,  you  had  an  angiogram  and  embolization  of  the\n\ngastroduodenal artery to manage the duodenal injury and hematoma.\n\nOn  August  22nd,  the  case  was  discussed  in  a  multi-disciplinary  team  (MDT)  meeting,  and  they\n\nconcluded  that  you  have  a  benign  CBD  stricture,  for  which  dilation  through  PTBD  was  done.  Mild\n\ndilation  of  the  ductal  system  was  observed,  and  they  recommended  stenting  and  internalizing  the\n\nPTBD.\n\nPatient:\n\nYes,  I  remember  all  that.  Then,  on  September  23rd,  I  had  another  ERCP  at  PKLI.  The  diagnosis\n\nafterward  was  common  hepatic  duct  and  bile  duct  stricture.  During  that  procedure,  they  found  a\n\npreviously  placed  plastic  pancreatic  duct  stent  and  a  percutaneous  drain.  The  cholangiogram\n\nrevealed  a  hepatic  duct  stricture,  and  the  cholangioscope  showed  some  abnormal  mucosa  in  the\n\ncommon  bile  duct,  likely  caused  by  inflammation  from  the  previously  placed  stent.  They  took  a\n\nforceps  biopsy,  and  a  single  plastic  biliary  stent  was  placed  in  the  left  hepatic  duct  with  good\n\ndrainage.\n\nI also had several imaging studies:\n\nA CT scan from July 18th showed subcapsular areas in the liver and multifocal splenic infarctions,\n\npossibly from a previous infection.\n\nAnother CT scan on August 16th showed some biliary stents, mild intrahepatic biliary dilatation, and\n\na hypodense area in the right lobe of the liver, which could be an evolving abscess. There was also\n\nsome infection in my lower left lung.\n\nI had a histopathology report from October 1st. The biopsy results indicated mild inflammation and\n\n\fminimal fibrosis in the common hepatic duct and bile duct, with a predominantly lymphoplasmacytic\n\ninfiltrate. They suspect IgG4-related disease and suggested correlating with serum IgG4 levels.\n\nDoctor:\n\nThe  biopsies  suggest  IgG4-related  disease,  which  is  characterized  by  fibrosis  and  inflammation  in\n\nthe bile ducts, among other tissues. It's good that you've had comprehensive imaging and lab tests.\n\nYour  labs  from  earlier  this  year  show  significant  fluctuations,  particularly  in  bilirubin  and  liver\n\nenzymes.  Your  most  recent  lab  results  (as  of  October  10th)  indicate  that  your  bilirubin  is  down  to\n\n1.0, which is an improvement. Your albumin and platelet count are also within more normal ranges\n\nnow. However, your liver enzymes (ALT and AST) remain elevated.\n\nWe  will  need  to  continue  monitoring  this  closely,  especially  considering  the  IgG4-related  disease\n\nsuspicion.\n\nPatient:\n\nYes, I saw that my bilirubin has improved, but the liver enzymes are still high. Whats the next step?\n\nDoctor:\n\nBased  on  your  condition  and  the  findings  from  your  imaging,  were  planning  to  continue  your\n\ntreatment with corticosteroids. I'll prescribe prednisolone 30 mg once daily for the next four weeks,\n\nalong  with  omeprazole  40  mg  for  gastric  protection,  and  a  calcium  +  vitamin  D  supplement.\n\nAdditionally, Id recommend that we check your serum IgG4 levels to further assess the IgG4-related\n\ndisease.\n\nAfter four weeks, we will follow up with further imaging to assess the response and decide on the\n\nnext steps. This may include a triphasic CT scan as discussed in the MDT meeting.\n\n\fPatient:\n\nOkay, I understand. Thank you.\n\nFollow-up Virtual Clinic Visit on November 22, 2024\n\nDoctor:\n\nHello, I see youve been dealing with the mid-distal CBD and common hepatic duct stricture for some\n\ntime now. Youve already had several procedures, including ERCP, PTBD, and an angiogram with\n\nembolization of the gastroduodenal artery.\n\nWe  had  another  MDT  discussion,  and  the  consensus  is  to  continue  with  your  current  medical\n\ntreatment  and  proceed  with  further  imaging,  particularly  a  triphasic  CT  scan.  This  will  give  us  a\n\nbetter idea of how things are progressing and help us plan the next steps.\n\nLets also continue monitoring your IgG4 levels and liver function closely. Please make sure to take\n\nthe prescribed medications regularly and keep track of any new symptoms.\n\nPatient:\n\nThank you, I will continue with the medications as you suggested. I will get the CT scan done and\n\nfollow up as advised.\n\nLab Results Summary:\n\nHemoglobin (Hb): 9.4 (07/07/24)  8.7 (04/08/24)\n\nWBC (White Blood Cells): 22.5 (07/07/24)  18.81 (04/08/24)\n\n\fPlatelets (PLTS): 593 (07/07/24)  638 (04/08/24)\n\nTotal Bilirubin: 54.5 (07/07/24)  1.7 (04/08/24)  1.82 (06/09/24)  1.0 (10/10/2024)\n\nDirect Bilirubin: 37.1 (07/07/24)  1.4 (04/08/24)  1.59 (06/09/24)  0.7 (10/10/2024)\n\nALT/AST: 92/92 (07/07/24)  108/46 (04/08/24)  128/63 (06/09/24)  173/86 (10/10/2024)\n\nAlkaline Phosphatase: 312 (07/07/24)  297 (04/08/24)  131 (06/09/24)  216 (10/10/2024)\n\nAlbumin: 2.1 (07/07/24)  3.8 (04/08/24)  4.12 (06/09/24)  4.6 (10/10/2024)\n\nCreatinine: 0.6 (07/07/24)  0.64 (04/08/24)\n\nSodium (Na+): 127 (07/07/24)  136 (04/08/24)\n\nPotassium (K+): 4.44 (07/07/24)  4.26 (04/08/24)\n\nINR: 1.0 (07/07/24)  0.93 (04/08/24)\n\nCA 19-9: 9.57 (10/10/2024)\n\nSerum Ceruloplasmin: 59 (normal)\n\nImmunology:\n\nAnti Nuclear Antibodies: Homogeneous\n\n\fAnti Mitochondrial Antibodies: Negative\n\nAnti Smooth Muscle Antibodies: Negative\n\nSerum Antiparietal Cells Antibodies: Negative\n\nAutoimmune Liver Disease Profile: Negative\n\nHepatitis B & C Screening: Negative\n\nBMI: 16.2 (07/07/24)  16.6 (04/08/24)\n\nECOG: 1 (consistent)\n\nBlood Group: O+ve\n\nPlan:\n\nContinue current medications: Prednisolone, Omeprazole, Calcium + Vitamin D\n\nFollow-up with triphasic CT scan\n\nRefer to hepatology for further management\n\n\f",
    "structured_data": {
        "PatientDemographics": {
            "Gender": "Male",
            "Age": "26",
            "MRN": "815506",
            "Diagnosis": "Cholangiocarcinoma"
        },
        "ClinicalSummary": {
            "ActiveSymptoms": [
                "Jaundice",
                "Generalized itching",
                "Weight loss"
            ],
            "NegativeFindings": [
                "No vomiting blood",
                "No ascites",
                "No confusion",
                "No fevers",
                "No night sweats",
                "No significant medical issues or surgeries in the past",
                "No allergies",
                "No cultural or spiritual needs",
                "No psychological issues"
            ]
        },
        "DiagnosticConclusions": [
            "Mid-CBD stricture",
            "Common hepatic duct stricture",
            "IgG4-related disease suspected"
        ],
        "TherapeuticInterventions": {
            "Medications": [
                "Cap Urso 250mg twice daily",
                "Risek 40mg once daily",
                "Motilium 10mg three times daily",
                "Qalsan-D once daily",
                "Ensure milk powder 6 tablespoons twice daily",
                "Beneprotein twice daily",
                "Prednisolone 30mg once daily",
                "Omeprazole 40mg once daily",
                "Calcium + Vitamin D supplement"
            ],
            "Procedures": [
                "ERCP",
                "PTBD",
                "Angioplasty and embolization of the gastroduodenal artery",
                "Repeat ERCP",
                "Biopsy"
            ]
        },
        "DiagnosticEvidence": {
            "ImagingFindings": [
                "CT scan showing liver infarctions, biloma formation, splenic infarctions",
                "CT scan showing mild intrahepatic biliary dilatation and splenic infarction",
                "CT scan showing subcapsular areas in the liver and multifocal splenic infarctions",
                "CT scan showing biliary stents and mild intrahepatic biliary dilatation"
            ],
            "LabResults": [
                "Hemoglobin: 9.4 (07/07/24), 8.7 (04/08/24)",
                "WBC: 22.5 (07/07/24), 18.81 (04/08/24)",
                "Total Bilirubin: 54.5 (07/07/24), 1.7 (04/08/24), 1.82 (06/09/24), 1.0 (10/10/2024)",
                "Direct Bilirubin: 37.1 (07/07/24), 1.4 (04/08/24), 1.59 (06/09/24), 0.7 (10/10/2024)",
                "ALT/AST: 92/92 (07/07/24), 108/46 (04/08/24), 128/63 (06/09/24), 173/86 (10/10/2024)",
                "Alkaline Phosphatase: 312 (07/07/24), 297 (04/08/24), 131 (06/09/24), 216 (10/10/2024)",
                "Albumin: 2.1 (07/07/24), 3.8 (04/08/24), 4.12 (06/09/24), 4.6 (10/10/2024)",
                "Creatinine: 0.6 (07/07/24), 0.64 (04/08/24)",
                "Sodium: 127 (07/07/24), 136 (04/08/24)",
                "Potassium: 4.44 (07/07/24), 4.26 (04/08/24)",
                "INR: 1.0 (07/07/24), 0.93 (04/08/24)",
                "CA 19-9: 9.57 (10/10/2024)"
            ],
            "PathologyFindings": [
                "Biopsy indicating mild inflammation and minimal fibrosis in the common hepatic duct and bile duct"
            ]
        },
        "ChronicConditions": {
            "ChronicDiseases": [
                "Cholangiocarcinoma"
            ],
            "Comorbidities": [
                "None"
            ]
        },
        "Follow-upPlan": {
            "PlannedConsultations": [
                "Refer to Dr. Ahmad Karim, gastroenterologist",
                "Refer to hepatology for further management"
            ],
            "ScheduledTests": [
                "Triphasic CT scan",
                "Check serum IgG4 levels"
            ],
            "NextAppointmentDetails": [
                "Follow-up after four weeks"
            ]
        },
        "VisitTimeline": [
            "July 11: ERCP",
            "July 13: PTBD",
            "July 18 to August 6: Hospitalization",
            "August 22: MDT discussion",
            "September 23: Repeat ERCP",
            "October 1: Biopsy results",
            "October 10: Lab results"
        ],
        "SummaryNarrative": {
            "ClinicalCourseProgression": "Patient developed jaundice and underwent multiple procedures for CBD stricture.",
            "DiagnosticJourney": "Multiple imaging studies and lab tests conducted to assess liver function and stricture.",
            "TreatmentResponse": "Bilirubin levels improved, but liver enzymes remain elevated.",
            "OngoingConcerns": "Monitoring of IgG4-related disease and liver function is necessary."
        }
    }
}