{
    "patient_id": "history_physical_70",
    "raw_text": "Gender: Female\n\nAge: 62\n\nMRN: 818344\n\nDiagnosis: Hepatocellular Carcinoma\n\nHistory and Physical:\n\nDoctor: Hello, Shamim. How have you been feeling since your last visit?\n\nPatient:  I've  been  having  some  issues,  Doctor.  I  started  feeling  anorexic,  and  recently,  I  noticed\n\nfresh blood in my stools after taking my medication, Levatinib. Also, I have developed rashes on my\n\nlimbs after taking Levatinib for about 15 days now.\n\nDoctor: I understand. Let's go over your health history to get a clearer picture. You've had diabetes\n\nand  hypertension  for  a  while,  and  this  started  four  months  ago  when  you  began  experiencing\n\nanorexia.  You  were  diagnosed  with  Hepatocellular  Carcinoma  (HCC),  and  thats  why  you  were\n\nreferred to us for further management. You also have a history of Hepatitis C, diagnosed in 2016,\n\nand you successfully achieved Sustained Virologic Response (SVR). Your last HCV PCR on August\n\n5th, 2024, was negative, which is great news.\n\nPatient: Yes, thats right. The HCV was under control, and Ive been following the treatment.\n\nDoctor:  Excellent.  Now,  lets  review  your  current  symptoms.  You  havent  experienced  any\n\nhematemesis  (vomiting  blood),  and  theres  no  significant  ascites  or  jaundice.  Your  weight  loss  has\n\nnot been significant either, and you havent needed any blood transfusions. Additionally, there have\n\nbeen no fevers or night sweats.\n\nPatient: Thats correct, Doctor.\n\n\fDoctor: Great. As for your medical history, youve been managing diabetes and hypertension. Theres\n\nno history of significant surgeries. However, I see you're allergic to contrast agents, so well need to\n\navoid those during any imaging procedures.\n\nPatient: Yes, I remember the reaction I had before.\n\nDoctor:  Understood.  Now,  lets  talk  about  your  current  medications.  Youre  currently  on  Levatinib  4\n\nmg, Sitagliptin, Diabetron 60 mg, Tasmi 20 mg, Carvedilol 6.25 mg, and Omeprazole 40 mg. Have\n\nyou noticed any other side effects or changes since starting Levatinib?\n\nPatient:  The  blood  in  stools  and  rashes  on  my  limbs  are  the  most  noticeable  changes.  No  other\n\nissues so far.\n\nDoctor: Alright, well need to address those concerns. I also see your family history is unremarkable\n\nfor  diabetes,  hypertension,  cancer,  or  other  chronic  diseases.  You  dont  have  any  psychological\n\nissues, and you dont report feeling depressed or having any suicidal thoughts.\n\nPatient: Thats correct, Doctor.\n\nDoctor:  Let's  take  a  look  at  your  examination  results.  You  appear  conscious  and  oriented,  with  a\n\nGCS  of  15/15,  which  is  normal.  Your  cardiovascular  exam  showed  normal  heart  sounds  without\n\nmurmurs,  and  your  respiratory  system  is  fine  with  bilateral  normal  vesicular  breathing.  Your\n\nabdomen is soft, non-tender, and non-distended.\n\nPatient: Thats reassuring.\n\nDoctor: Lets move on to your investigations. Your most recent ultrasound on July 6th, 2024, showed\n\n\fa  cirrhotic  liver,  a  solitary  solid  liver  mass,  mild  splenomegaly,  and  cholelithiasis.  The  CT  scan  on\n\nAugust  27th,  2024,  revealed  a  well-defined  lesion  in  Segment  IVB,  likely  cholangiocarcinoma  or\n\nmetastatic,  along  with  a  dilated  portal  vein  and  splenomegaly.  We  have  a  recent  CT  scan  from\n\nOctober 3rd, 2024, but the report is still pending.\n\nPatient: What does that mean for me, Doctor?\n\nDoctor:  Based  on  the  imaging,  we  suspect  an  atypical  case  of  Hepatocellular  Carcinoma  (HCC),\n\npossibly  related  to  cholangiocarcinoma  or  metastasis.  We're  awaiting  the  final  radiological  opinion\n\nbefore finalizing your treatment plan.\n\nPatient: I see. What about my lab results?\n\nDoctor: Your recent labs show that your hemoglobin is 12.9, which is normal. Your white blood cell\n\ncount is also within the normal range at 5.21. Platelets are slightly higher at 324, and your bilirubin\n\nlevels are within the normal range, with a total bilirubin of 0.32 and direct bilirubin of 0.2. Your liver\n\nenzymes, ALT and AST, are normal, and your alkaline phosphatase has increased slightly to 113.\n\nYour albumin is at 4.04, which is good, and your creatinine is low at 0.47. Electrolytes like sodium\n\nand potassium are normal. Your AFP is still elevated at 26.5, and PIVKA II is quite high at 3844. CA\n\n19-9 is elevated at 60.7, but CEA is normal at 0.97.\n\nPatient: So, my AFP and PIVKA II are high. Does that mean the cancer is active?\n\nDoctor: Elevated AFP and PIVKA II can be associated with liver cancer, which is why well need to\n\nmonitor  these  levels  closely.  Based  on  your  Child-Pugh  score  of  A5  and  your  MELD  score  of  9,\n\nyoure in a better condition than others with more advanced cirrhosis. We will have a clear plan once\n\nwe receive the full report from the radiologist.\n\n\fPatient: What happens next?\n\nDoctor: We will stop Levatinib for now, as it may be contributing to your symptoms. Well follow up\n\nafter your CT report is reviewed by the radiologist. Then, well discuss the next steps based on that\n\nopinion.\n\nPatient: Alright, Doctor. Ill wait for the report and follow your guidance.\n\nDoctor:  Thank  you,  Shamim.  We  will  keep  monitoring  your  condition  closely  and  ensure  youre\n\ngetting the best possible care.                                                                                                          \n\nPatient:  Doctor,  I  came  for  my  follow-up  visit.  Im  still  feeling  some  pain,  especially  around  the\n\nincision site. It comes and goes, and I also have this burning sensation in my hands and feet.\n\nDoctor: I understand. Lets go over everything. First, how are things in general since your surgery on\n\nOctober 31st? You were discharged on November 5th, and its been a little over two months since\n\nthen.\n\nPatient: Yes, it's been a while. Ive had some issues like a bit of pain near the incision, but nothing\n\ntoo severe.\n\nDoctor: Thats expected during the recovery process, but well monitor it. Ill also take a look at your\n\nhistopathology  report  from  the  surgery.  It  shows  that  the  mass  removed  from  your  liver  was  an\n\nexophytic  mass,  moderately  to  poorly  differentiated  hepatocellular  carcinoma  (HCC),  10.5  cm  in\n\nsize.  It  had  necrosis  present,  and  the  tumor  was  very  close  to  the  liver  margin,  but  there  was  no\n\nmicrovascular invasion.\n\n\fPatient: So, what does that mean for me, Doctor? Is the cancer gone now?\n\nDoctor: The fact that we removed the tumor is good news. However, you still have liver cirrhosis with\n\nchronic hepatitis and steatosis in the background. The gallbladder also showed chronic cholecystitis,\n\nbut theres no malignancy in the gallbladder.\n\nPatient: What about my liver? Whats next for me now?\n\nDoctor:  We  need  to  keep  monitoring  your  liver  closely,  especially  since  you  have  cirrhosis.  Your\n\nlatest ultrasound from November 12th showed some mild ascites, which is common in cirrhosis, and\n\nthere was no pleural effusion. We also found a small collection in the gallbladder fossa, which well\n\nkeep an eye on.\n\nPatient: Okay. How about my blood results? Are there any changes?\n\nDoctor:  Lets  go  over  them.  Your  hemoglobin  level  went  from  12.4  g/dL  in  August  to  11.1  g/dL  in\n\nNovember, and now its back up to 12.6 g/dL. Your white blood cell count has increased from 4.9 to\n\n6.04,  which  is  still  within  normal  range.  Platelets  have  dropped  from  324  to  171,  which  we  will\n\nmonitor.  Your  liver  function  tests,  like  ALT  and  AST,  are  normal,  but  your  bilirubin  level  has\n\nincreased slightly to 0.38 in January from 0.32 in October. Your albumin levels dropped a little but\n\nare still acceptable at 3.73 g/dL.\n\nPatient: That doesnt sound too bad, right? What does this mean for my treatment?\n\nDoctor: Overall, its a mixed picture. Your liver function is stable, which is good. However, since your\n\nHCC was moderate to poorly differentiated, we need to start you on Sorafenib, 200 mg twice daily.\n\nIts an oral chemotherapy drug that can help slow the growth of cancer. We need to be aware of side\n\n\feffects, which I will explain to you.\n\nPatient: What should I expect from the treatment? How long will I need to take Sorafenib?\n\nDoctor:  Youll  need  to  take  Sorafenib  for  an  extended  period,  but  well  monitor  you  closely.  If  your\n\nliver starts to fail within the next 8 months or if new tumors form or spread outside the liver, we may\n\nconsider  a  liver  transplant.  However,  if  your  liver  stays  stable,  and  theres  no  tumor  growth  or\n\nmetastasis,  we  can  continue  with  the  medical  management.  If  we  see  that  the  tumor  is\n\nangioinvasive or has spread outside the liver, chemotherapy would be the next step.\n\nPatient: That sounds complicated. Will I be okay?\n\nDoctor: We will continue to monitor your condition carefully, and well adjust treatment as necessary.\n\nWell do another follow-up in about 4 months, where well check your lab results, AFP levels, and an\n\nupdated CT scan. I also want to make sure youre feeling okay on Sorafenib, so well check for side\n\neffects closely.\n\nPatient:  Alright,  Doctor.  Thank  you  for  explaining  everything.  Ill  keep  up  with  the  medications  and\n\nfollow-up appointments.\n\nDoctor: Youre welcome. Keep me updated if you notice any changes or new symptoms. Take care,\n\nand well see you in 4 months.\n\n\f\f",
    "structured_data": {
        "PatientDemographics": {
            "Gender": "Female",
            "Age": "62",
            "MRN": "818344",
            "Diagnosis": "Hepatocellular Carcinoma"
        },
        "ClinicalSummary": {
            "ActiveSymptoms": [
                "anorexia",
                "fresh blood in stools",
                "rashes on limbs",
                "pain around incision site",
                "burning sensation in hands and feet"
            ],
            "NegativeFindings": [
                "no hematemesis",
                "no significant ascites",
                "no jaundice",
                "no significant weight loss",
                "no blood transfusions",
                "no fevers",
                "no night sweats"
            ]
        },
        "DiagnosticConclusions": [
            "suspected atypical case of Hepatocellular Carcinoma possibly related to cholangiocarcinoma or metastasis",
            "moderately to poorly differentiated hepatocellular carcinoma"
        ],
        "TherapeuticInterventions": {
            "Medications": [
                "Levatinib 4 mg",
                "Sitagliptin",
                "Diabetron 60 mg",
                "Tasmi 20 mg",
                "Carvedilol 6.25 mg",
                "Omeprazole 40 mg",
                "Sorafenib 200 mg twice daily"
            ],
            "Procedures": []
        },
        "DiagnosticEvidence": {
            "ImagingFindings": [
                "cirrhotic liver",
                "solitary solid liver mass",
                "mild splenomegaly",
                "cholelithiasis",
                "well-defined lesion in Segment IVB",
                "dilated portal vein",
                "mild ascites",
                "small collection in gallbladder fossa"
            ],
            "LabResults": [
                "hemoglobin 12.9",
                "white blood cell count 5.21",
                "platelets 324",
                "total bilirubin 0.32",
                "direct bilirubin 0.2",
                "ALT normal",
                "AST normal",
                "alkaline phosphatase 113",
                "albumin 4.04",
                "creatinine 0.47",
                "sodium normal",
                "potassium normal",
                "AFP 26.5",
                "PIVKA II 3844",
                "CA 19-9 60.7",
                "CEA 0.97"
            ],
            "PathologyFindings": [
                "exophytic mass",
                "moderately to poorly differentiated hepatocellular carcinoma 10.5 cm in size",
                "necrosis present",
                "tumor very close to liver margin",
                "no microvascular invasion"
            ]
        },
        "ChronicConditions": {
            "ChronicDiseases": [
                "diabetes",
                "hypertension",
                "Hepatitis C"
            ],
            "Comorbidities": [
                "liver cirrhosis",
                "chronic hepatitis",
                "steatosis",
                "chronic cholecystitis"
            ]
        },
        "Follow-upPlan": {
            "PlannedConsultations": [],
            "ScheduledTests": [
                "CT scan",
                "lab results check in 4 months"
            ],
            "NextAppointmentDetails": [
                "follow-up in 4 months"
            ]
        },
        "VisitTimeline": [
            "last visit",
            "surgery on October 31st",
            "discharged on November 5th"
        ],
        "SummaryNarrative": {
            "ClinicalCourseProgression": "Patient has been experiencing symptoms related to HCC and treatment side effects.",
            "DiagnosticJourney": "Multiple imaging studies and lab tests conducted to assess liver condition and cancer status.",
            "TreatmentResponse": "Patient's liver function is stable, but HCC is moderately to poorly differentiated requiring Sorafenib.",
            "OngoingConcerns": "Monitoring for liver function, tumor growth, and side effects from Sorafenib."
        }
    }
}